{
  "DOI": "10.12688/gatesopenres.12751.2",
  "FullTextURL": "https://gatesopenresearch.org/extapi/article/pdf?doi=10.12688/gatesopenres.12751.2",
  "PublisherName": "Gates Open Research",
  "Content": [
    {
      "PageNumber": 1,
      "TextContent": "SOFTWARE TOOL ARTICLE\nPoint-of-contact Interactive Record Linkage (PIRL): A\nsoftware tool to prospectively link demographic surveillance\nand health facility data [version 2; peer review: 2 approved]\nChristopher T. Rentsch 1, Chodziwadziwa Whiteson Kabudula2, Jason Catlett3,\nDavid Beckles 4, Richard Machemba5, Baltazar Mtenga5, Nkosinathi Masilela2,\nDenna Michael5, Redempta Natalis6, Mark Urassa5, Jim Todd1,5, Basia Zaba 1,\nGeorges Reniers1,2\n1Department of Population Health, London School of Hygiene & Tropical Medicine, London, WC1E 7HT, UK\n2MRC/Wits Rural Public Health and Health Transitions Research Unit (Agincourt), School of Public Health, Faculty of Health Sciences,\nUniversity of the Witwatersrand, Johannesburg , 2193, South Africa\n3SELECT Star, Atlanta, GA, 30309, USA\n4Independent Researcher, London, UK\n5The Tazama Project, National Institute for Medical Research, Mwanza, Tanzania\n6District Medical Officer, Ministry of Health Tanzania, Magu District, Tanzania\nFirst published: 06 Nov 2017, 1:8\nhttps://doi.org/10.12688/gatesopenres.12751.1\nLatest published: 11 Jan 2018, 1:8\nhttps://doi.org/10.12688/gatesopenres.12751.2\nv2\nAbstract\nLinking a health and demographic surveillance system (HDSS) to data\nfrom a health facility that serves the HDSS population generates a\nresearch infrastructure for directly observed data on access to and\nutilization of health facility services. Many HDSS sites, however, are in\nareas that lack unique national identifiers or suffer from data quality\nissues, such as incomplete records, spelling errors, and name and\nresidence changes, all of which complicate record linkage approaches\nwhen applied retrospectively. We developed Point-of-contact\nInteractive Record Linkage (PIRL) software that is used to\nprospectively link health records from a local health facility to an HDSS\nin rural Tanzania. This prospective approach to record linkage is\ncarried out in the presence of the individual whose records are being\nlinked, which has the advantage that any uncertainty surrounding\ntheir identity can be resolved during a brief interaction, whereby\nextraneous information (e.g., household membership) can be referred\nto as an additional criterion to adjudicate between multiple potential\nmatches. Our software uses a probabilistic record linkage algorithm\nbased on the Fellegi-Sunter model to search and rank potential\nmatches in the HDSS data source. Key advantages of this software are\nits ability to perform multiple searches for the same individual and\nsave patient-specific notes that are retrieved during subsequent clinic\nvisits. A search on the HDSS database (n=110,000) takes less than 15\nOpen Peer Review\nApproval Status\n1 2\nversion 2\n(revision)\n11 Jan 2018\nversion 1\n06 Nov 2017 view view\nDuncan Smith , University of Manchester,\nManchester, UK\n1.\nHye-Chung Kum, Texas A & M University,\nCollege Station, USA\nTexas A & M University, College Station, USA\n2.\nAny reports and responses or comments on the\narticle can be found at the end of the article.\nGates Open Research\nPage 1 of 15\n"
    },
    {
      "PageNumber": 2,
      "TextContent": "Gates Open Research 2018, 1:8 Last updated: 23 MAR 2022\nCorresponding author: Christopher T. Rentsch (christopher.rentsch@lshtm.ac.uk)\nAuthor roles: Rentsch CT: Conceptualization, Data Curation, Funding Acquisition, Investigation, Methodology, Project Administration,\nResources, Software, Supervision, Validation, Visualization, Writing – Original Draft Preparation, Writing – Review & Editing; Kabudula\nCW: Conceptualization, Data Curation, Methodology, Resources, Software, Supervision, Validation, Writing – Original Draft Preparation,\nWriting – Review & Editing; Catlett J: Data Curation, Methodology, Resources, Software, Supervision, Writing – Original Draft\nPreparation, Writing – Review & Editing; Beckles D: Conceptualization, Data Curation, Methodology, Resources, Software, Supervision,\nWriting – Original Draft Preparation, Writing – Review & Editing; Machemba R: Investigation, Methodology, Project Administration,\nResources, Software, Supervision, Writing – Review & Editing; Mtenga B: Data Curation, Investigation, Methodology, Project\nAdministration, Resources, Software, Supervision, Writing – Review & Editing; Masilela N: Conceptualization, Data Curation,\nMethodology, Resources, Software, Writing – Review & Editing; Michael D: Investigation, Project Administration, Resources, Supervision,\nWriting – Review & Editing; Natalis R: Investigation, Project Administration, Resources, Supervision, Writing – Review & Editing; Urassa\nM: Conceptualization, Data Curation, Funding Acquisition, Investigation, Methodology, Project Administration, Resources, Software,\nSupervision, Validation, Visualization, Writing – Review & Editing; Todd J: Conceptualization, Data Curation, Funding Acquisition,\nInvestigation, Methodology, Project Administration, Resources, Software, Supervision, Validation, Visualization, Writing – Review &\nEditing; Zaba B: Conceptualization, Data Curation, Funding Acquisition, Investigation, Methodology, Project Administration, Resources,\nSoftware, Supervision, Validation, Visualization, Writing – Original Draft Preparation, Writing – Review & Editing; Reniers G:\nConceptualization, Data Curation, Funding Acquisition, Investigation, Methodology, Project Administration, Resources, Software,\nSupervision, Validation, Visualization, Writing – Original Draft Preparation, Writing – Review & Editing\nCompeting interests: No competing interests were disclosed.\nGrant information: Bill & Melinda Gates Foundation grants to the ALPHA Network [BMGF-OPP1082114] and the MeSH Consortium\n[BMGF-OPP1120138]. The Kisesa HDSS is a member of the INDEPTH Network and has received funding from the Global Fund [TNZ-405-\nGO4-H, TNZ-911-G14-S].\nThe funders had no role in study design, data collection and analysis, decision to publish, or preparation of the manuscript.\nCopyright: © 2018 Rentsch CT et al. This is an open access article distributed under the terms of the Creative Commons Attribution\nLicense, which permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited.\nHow to cite this article: Rentsch CT, Kabudula CW, Catlett J et al. Point-of-contact Interactive Record Linkage (PIRL): A software tool\nto prospectively link demographic surveillance and health facility data [version 2; peer review: 2 approved] Gates Open Research\n2018, 1:8 https://doi.org/10.12688/gatesopenres.12751.2\nFirst published: 06 Nov 2017, 1:8 https://doi.org/10.12688/gatesopenres.12751.1\nseconds to complete. Excluding time spent obtaining written consent,\nthe median duration of time we spend with each patient is six\nminutes. In this setting, a purely automated retrospective approach to\nrecord linkage would have only correctly identified about half of the\ntrue matches and resulted in high linkage errors; therefore\nhighlighting immediate benefit of conducting interactive record\nlinkage using the PIRL software.\nKeywords\ndata linkage, interactive record linkage, health and demographic\nsurveillance systems, health facility, sub-Saharan Africa\nGates Open Research\nPage 2 of 15\n"
    },
    {
      "PageNumber": 3,
      "TextContent": "Gates Open Research 2018, 1:8 Last updated: 23 MAR 2022\nIntroduction\nThe amount of collected data is ever-increasing in various\nsectors, including healthcare and government administration.\nWhile each individual data source holds value and was likely\ncreated for a specific purpose, researchers could study more\ncomplex relationships by combining data sources holding\ninformation on the same entity or individual. A recent Wellcome\nTrust report detailed how record linkage – the matching of an\nindividual’s records between two or more data sources – adds to\nthe value of medical research in low- and middle-income as well\nas high-income countries1. Broadly, record linkage can increase\nthe range of questions that could be asked, provide a historical\nperspective necessary for some studies, improve the statistical\nproperties of analyses, and make better use of resources.\nThe statistical framework for record linkage was largely developed\nin the 1950s2 and 1960s3. Two popular methods of record\nlinkage have been used to combine data sources. Deterministic\nrecord linkage4 is a rule-based approach that typically\nrequires exact matching on a set of identifiers existing in all data\nsources. Probabilistic methods5–7 can be employed to assign weights\nbased on the (dis)similarity of identifiers (e.g., name, sex, and date\nof birth) between records.\nIn the United Kingdom, researchers use record linkage to merge\nthe Clinical Practice Research Datalink – one of the largest\ndatabases of longitudinal medical records from primary care in\nthe world – to a variety of other existing data sources that hold\ndata on cardiovascular and cancer events, hospitalisation, and\nmortality8. Publications using this data infrastructure cover a\nvast range of topics, including studies showing the absence of an\nassociation between measles, mumps, and rubella (MMR)\nvaccine and autism9, cardiovascular risk after acute infection10, and\nthe association between body mass index and cancer11.\nLocated in several low- and middle-income countries, health\nand demographic surveillance systems (HDSS) are effective and\ncomprehensive data collection systems that primarily measure\nthe fertility, mortality, and other self-reported health information\nof an entire population. However, such self-reports usually\nlack detail and accuracy about the clinical events and services\nreceived, and their retrospective nature means they quickly\nbecome dated. Linking an HDSS database to data from a health\nfacility that serves the HDSS population produces a research\ninfrastructure for generating directly observed data on access to\nand utilization of health facility services12.\nMany HDSS sites, contrary to record linkage studies conducted\nin high-income countries, are in areas that lack unique national\nidentifiers or suffer from data quality issues, such as incomplete\nrecords, spelling errors, and name and residence changes,\nall of which complicate both deterministic and probabilistic\napproaches when applied retrospectively. In these settings, a\nsemi-automatic record linkage process that incorporates manual\ninspection of potential matches, such as interactive record\nlinkage13,14, is preferred. In our implementation of interactive\nrecord linkage, which we call point-of-contact interactive record\nlinkage (PIRL), we carry out the manual inspection of potential\nmatches identified by our linkage algorithm in the presence\nof the individual whose records are being linked. This\nprospective approach to record linkage has the advantage that\nany uncertainty surrounding their identity can be resolved during\na brief interview, whereby extraneous information (e.g. household\nmembership) can be referred to as an additional criterion\nto adjudicate between multiple potential matches. It also provides\nan opportunity to authenticate individuals who can legitimately\nbe linked to more than one record in the HDSS because\nthey have resided in more than one household. Finally, ethical\nand privacy concerns are properly addressed with PIRL as\nit offers an advantage to seek informed consent and individuals\nare made fully aware of how their data are being used.\nThere are numerous publicly and commercially available\nrecord linkage software packages. Herzog et al.15 adapted\na comprehensive checklist16 for evaluating record linkage software,\nincluding questions regarding the amount of control the user\nhas over the record linkage methodology, data management and\nstandardisation, and post-linkage functions. Many of the available\nsoftware packages are designed for batch linkages, such\nas those used in purely automated retrospective linkage17,18.\nGiven the novelty of the PIRL approach where searches are individually\nsupervised, we opted to build our own software package\nto suit our specific needs. By designing our own software, we\nmaintained full control over the specification of the linkage\nalgorithm, including the match parameters, weights, agreement\nrules, string comparators, and how to handle missing data.\nWe also required the ability to save session-specific notes that\ncan be retrieved in future linkage sessions.\nWe introduced our PIRL software to prospectively link health\nrecords to HDSS records in a rural ward in northeast Tanzania.\nAn analysis of the data created by our implementation of the\nsoftware and how it compares to purely automated retrospective\nlinkage has previously been published19. This paper describes our\nimplementation of this software, and we attach a GitHub link20\nto the full source code for others to download and amend to\ntheir own research needs.\nMethods\nData sources\nThe Kisesa observational HIV cohort study was established\nin 1994 and is located in a rural ward in the Magu district of\nMwanza region in northwest Tanzania. It comprises demographic\nsurveillance carried out through household interviews and\npopulation-based HIV surveillance based on individual serological\ntests and interviews. The HDSS databases include biannual\nAmendments from Version 1\nWe thank the reviewers for their comments and suggestions. We\nhave carefully reviewed them, and incorporated them into the\nupdated version of our paper. We feel that the comments have\nresulted in positive changes to our manuscript, which include a\nclearer definition of existing record linkage methodology, a brief\ncall to other implementations of interactive record linkage, a\ndescription of how we calculated our uI probabilities, an additional\ndescription of privacy during the record linkage interview, and a\nfew other relatively minor changes as suggested by the reviewers.\nSee referee reports\nREVISED\nPage 3 of 15\n"
    },
    {
      "PageNumber": 4,
      "TextContent": "Gates Open Research 2018, 1:8 Last updated: 23 MAR 2022\nrounds (31 to date) of household-based surveys that collect information\non births, pregnancies, deaths, in- and out-migration,\nand spousal and parent-child relationships. One major weakness\nof the Kisesa HDSS is the lack of reconciling records of\nindividuals who move households within the HDSS area. Therefore,\nwhile an HDSS ID is unique to a single individual, some\nindividuals may have multiple HDSS IDs if they resided in more\nthan one household in the HDSS area since the start of the HDSS\nin 1994. There have been eight rounds of HIV surveillance\nconducted every three years, with a detailed questionnaire on sexual\nbehaviour and partnership factors, fertility outcomes, HIV-related\nknowledge, and use of health services. Individuals who participate\nin an HIV surveillance round are given a unique identifier,\nand their current unique identifier from the HDSS is also crossreferenced\non their record.\nA government-run health centre is situated in the Kisesa HDSS\ncatchment area. Three clinics located in the Kisesa Health\nCentre were initially targeted as record linkage sites: the HIV\ncare and treatment centre (CTC), the HIV testing and counselling\nclinic (HTC), and the antenatal clinic (ANC) which includes\nprevention of mother-to-child transmission services; all of which\noperate according to national guidelines and protocols. The\nCTC databases have been fully digitised, and data clerks regularly\nupdate and run data checks on these data. For the ANC and\nHTC clinics, we developed electronic data capture systems and\ndigitised the paper-based logbooks.\nImplementation\nOur computer software utilises a probabilistic search algorithm\nto identify and rank potential matches in the HDSS database\n(n=110,000). The algorithm incorporates the following\nparameters or data fields: up to three names for the individual;\nsex; year, month, and day of birth; village and sub-village; up to\nthree names of a household member; and up to three names for\nthe ten-cell leader of the patient. A ten-cell leader is an individual\nwho acts as a leader for a group of ten households and these\npositions have been relatively stable over time. The algorithm\nused for searching possible matches and ranking them is\nbased on the Fellegi-Sunter record linkage model2,3, with match\nprobabilities (mi) that have been adopted from a pilot study\nin the Agincourt HDSS21. The ui probabilities, defined as chance\nagreement between two records which are true non-matches,\nwere derived from the Kisesa HDSS data consistent with\nprevious literature7. Let M be a set of true matches and U be\na set of true non-matched record pairs. Two individual\nagreement probabilities are defined for each field i in record\npair j as follows:\nmatch probability: mi = P(field i agrees | j ϵ M) (1.1)\nunmatch probability: ui = P(field i agrees | j ϵ U) (1.2)\nFor a given field with match probability mi and unmatch\nprobability ui, the software calculates the matching weights\nwai as = log2[mi/ui] for fields where both datasets agree, and\nwdi as = log2[(1-mi)/(1-ui)] where they disagree. Assuming\nindependence of observations across the fields, the match score\nis computed by summing the weights across all fields3,15.\nAgreement conditions vary for each of the parameters. Spelling\nerrors, the use of more than one name (including nicknames),\nand interchangeable name order complicate locating an exact\nmatch between names in these databases; thus, the linkage algorithm\nallows for all pairwise comparisons between reported\nnames and names found in the HDSS. In addition, the software\nuses a Jaro-Winkler string comparator approach to compare\nthe name fields between the two data sources22. Previous\nresearch has shown the Jaro-Winkler method produces similar\nresults to Double Metaphone and Soundex string comparators\nin a southern African context21. A Jaro-Winkler score ≥0.8 was\nconsidered a match for each collected name. Sex, village, and\nsub-village required an exact match, while the year of birth\ncould differ by up to two years.\nOperation\nA full user guide including screen shots and step-by-step\ninstructions on how we operationalise this software is attached\n(Supplementary File 1). Briefly, as individuals arrive to any of\nthe target clinics, a fieldworker introduces him/herself and then\ninvites the attendee to take part in the linkage study, which\ninvolved a brief interview. The primary goals of the brief interview\nare to explain the study, seek informed consent, and identify\nthe HDSS records of all participants with a residency history in\nthe HDSS.\nOur team uses a dedicated desk located within the clinic,\nbut out of the way of normal clinic operations, to conduct the brief\ninterviews, and therefore did not interrupt or interfere with clinical\npractice. While we highly recommend ensuring privacy during\neach patient interaction, the interview only involves asking for\ndemographic information, such as name, sex, birthdate, and\nresidence details, and does not ask for any medical information.\nIn addition, all collected data from a previous session is cleared\nfrom the system at the end of each patient interaction. Therefore,\nto enhance the accuracy of the data, we allow patients to watch\ntheir information be entered into the software and ask them to\nverify what has been collected.\nThe first step after obtaining written consent is to collect\nall clinic identifiers for the patient. The software uses these\nclinic identifiers to retrieve previously collected information and\nmatches made on patients interviewed during a prior visit.\nAfter all clinic identifiers are collected, personal and residence\ndetails are entered into the system (Figure 1). Information\nfrom most of these fields contribute to the linkage algorithm\ndescribed in the Implementation section above.\nOnce all personal and residence details are entered, the user\ninitiates an initial search through the HDSS data source. The\nsoftware computes a match score for each record in the HDSS\ndatabase, ranks them from highest to lowest based on match\nscore, and outputs the top 20 records within 15 seconds. While\nmanually searching through these potential matches, the user\ncan view the full list of household members associated with\neach HDSS record. The user can then inquire with the patient to\nidentify which HDSS record(s), if any, are a true match.\nPage 4 of 15\n"
    },
    {
      "PageNumber": 5,
      "TextContent": "Gates Open Research 2018, 1:8 Last updated: 23 MAR 2022\nFigure 1. User interface of Point-of-contact Interactive Record Linkage (PIRL) software.\nAn important feature of this software is the ability to perform\nmultiple search attempts for a single patient. If an initial search\nattempt does not result in a match, the user can further inquire\ninto the possible use of nicknames, maiden names, or residency\nepisodes at other addresses, and perform consecutive searches\nwith this updated information. If one or more HDSS records are\nnot found, the user can enter details of the missing records into a\nfree-text field called “match notes.” These match notes are retrieved\nby clinic identifiers and can be used to guide interviews and\nsearches during subsequent visits. When a clinic identifier\nis entered into the system that has already been collected, the\nsoftware automatically displays the match status (e.g., matched,\nnot matched) and saved matched notes to the user. The dates\nof all follow-up visits are automatically logged into the system.\nBecause we use this software in an area without reliable internet\nconnectivity, we perform manual backups and syncs of the\nback-end data at the end of each working day as a way to mitigate\nany risk for loss of collected data. Full details on the\nimport and export routines can be found in Annex 2 of the attached\nuser guide (Supplementary File 1). Briefly, the data manager\nexports a backup file from each of the user’s machines using\nSQL Server Management Studio (SSMS). Then, the backup\nfiles are imported into SSMS on the data manager’s machine, and\na SQL program automatically merges, updates, and collates the\ndata collected from previous days. Finally, the data manager\nexports the combined backup file and imports it onto each of\nthe user machines. Source code for these import and export\nroutines can also be found on GitHub.\nWe employ data integrity checks within the software and\non the back-end data. Due to the importance of clinical identifiers,\nall ID fields require double entry. Furthermore, HTC IDs\nare ensured through modulo-97 check digits, and ANC and\nCTC IDs have specific formats that the software confirms. The\nsoftware also displays warning messages to the user if they attempt\nto match to a record that has an absolute difference in birth year\nof >10 years or the sum of the Jaro-Winkler name scores is ≤1.6.\nTo validate the matches in the back-end database, the lead\nauthor performs periodic and manual, back-end inspection of\nthe data. These data integrity checks flag individuals who are\nmatched to multiple HDSS records with large age differences\n(>10 years), of conflicting sex, within the same household,\nor with overlapping residency episodes in which one record’s\nstart date occurred before another record’s end date. Over\n18 months, only eight (0.2%) out of 3,456 matches were deemed\nunlikely and were deleted from the back-end database.\nSystem requirements\nThe user interface (UI) portion of the software was coded using\nC# language in Microsoft Visual Studio 2013 Community edition.\nPage 5 of 15\n"
    },
    {
      "PageNumber": 6,
      "TextContent": "Gates Open Research 2018, 1:8 Last updated: 23 MAR 2022\nThe database management system was coded in Microsoft SQL\nServer 2012 Express. The software has been developed for\nmachines running a Windows 7 operating system.\nUsers who wish to edit source code to tailor the software\nto their specific needs will need both Visual Studio and SSMS.\nHowever, users who only need to run the software will need\nSSMS alone.\nFull installation instructions can be found in Annex 1 of the\nattached user guide (Supplementary File 1).\nUse cases\nInput dataset\nDue to the nature of the software and its requirement for\npersonally identifiable information, we are unable to provide\nreal HDSS data used in our implementation of the software.\nHowever, we did create a dataset of 100 fake HDSS records that\nrandomly sampled information found in the real data. Each field\nwas sampled separately to break any links of information that\ncould identify an individual. Spelling alterations, change of\nnames, and other minor errors to birthdays or residence details\nwere made to make the example cases described below more\nrealistic to what we experience in the field. The data and a\ncodebook for the fake input dataset are attached (Supplementary\nFile 2). The script used to create the fake input dataset is also\nattached (Supplementary File 3).\nOutput datasets\nThe software creates four password-encrypted tables and stores\nthem in SSMS. The first table, called the ‘Registry’, stores\nclinic identifiers, personal and residence details reported by the\npatient and entered by the fieldworker into the main view of the\nsoftware (Figure 1). A new record is created for each search\nattempt. The second table, called ‘Matches’, stores all matches\nmade to HDSS records, including the HDSS identifier, match\nscore, and the rank of the match. The third table, called ‘Notes’,\nholds the collection of match notes made during an interview.\nThe fourth table, called ‘Visits’, is a file containing all visit\ndates for each patient.\nThree auto-generated identifiers are used to link records that\npertain to a specific individual between the four back-end data\ntables: the local machine name, a session ID, and a record number.\nFor each local machine, a session ID consisting of numerical\nvalues for year, month, day, hour, minute, and second gets\nautomatically created at the beginning of a new session\n(e.g., ‘20170601093000’ for a session initiated at exactly\n9:30:00am local time on 1 June 2017). Within each session,\na six-digit record number is created and iterates for each search\nattempt within a session. Whenever a match is made (table\n2), match notes are stored (table 3), or a visit date is recorded\n(table 4), the values for the machine name, session ID, and record\nnumber are stamped on those records.\nAn example output database from the cases below and its\ncodebook are attached (Supplementary File 4).\nCase 1\nThe patient enters the CTC and agrees to take part in this study.\nThe fieldworker collects his CTC ID and enters it into the\nsystem along with the personal and residence details he reports\n(Table 1). The software displays the top 20 potential matches to\nthe fieldworker. The fieldworker selects the top ranked record to\nview the entire household membership and confirms the reported\nco-resident is listed. There are minor spelling errors in the\nnames, but the year of birth, years of residency, and residence\ndetails match exactly. Thus, the fieldworker assigns the match\nto this record and ends the search as all reported residency\nepisodes were found. The fieldworker saves a match note that\nsays, “All reported residency episodes found.” The fieldworker\nthen stores the visit date and thanks the patient for his time.\nCase 2\nThe patient enters the ANC and agrees to take part in\nthe study. The fieldworker collects her ANC ID, but also notices\nshe carries an HTC card, so they collect that information as well\n(these cross-clinic links are common in our fieldwork and\nallow us to link patient records across multiple services). The fieldworker\nalso enters the personal and residence details she reports\n(Table 1). The software displays the top 20 potential matches\nto the fieldworker. The fieldworker selects the top ranked record\nto view the entire household membership and confirms the\nreported co-resident is listed. The years of residence are only off\nby one year, and the birth year and residence details match\nexactly. There are minor spelling mistakes in the names reported,\nbut the reported names are switched in order on the HDSS\nrecord, which is not uncommon for the data in this setting. The\nfieldworker assigns the match to this record and ends the search\nas all reported residency episodes were found. The fieldworker\nsaves a match note that says, “All reported residency episodes\nfound.” The fieldworker then stores the visit date and thanks\nthe patient for her time.\nCase 3\nThe patient enters the HTC and agrees to take part in\nthe study. The fieldworker collects her HTC ID and enters it\ninto the system along with the personal identifiers she reports\n(Table 1). During the interview, she reports she had two residency\nepisodes in different villages, one from 1995 to 2003 and\nthe other from 2006 to 2014. The patient reports to have\nlived outside of the HDSS area between 2003 and 2006. The\nfieldworker enters the information for the most recent residency\nepisode and initiates the search. The software displays the\ntop 20 potential matches from the HDSS to the fieldworker.\nThe fieldworker selects the top ranked record to view and\nconfirm that the other household members are correct. There\nare minor spelling errors in the names and the year of birth is\noff by one year, but the residence details are the same, so the\nfieldworker assigns this record as a match.\nThe fieldworker continues moving down the list of potential\nmatches and tries to find the record associated with the\nolder residency episode. However, the fieldworker finishes going\nthrough the list without detecting the record. The fieldworker\nPage 6 of 15\n"
    },
    {
      "PageNumber": 7,
      "TextContent": "Gates Open Research 2018, 1:8 Last updated: 23 MAR 2022\nTable 1. Personal identifiers used for three case patients sampled from the fake dataset with varying numbers of residency\nepisodes.\nCase 1 Case 2 Case 3\nResidency\nepisode 1 1 1 2 3\nClinic ID(s) CTC: 77-10-4545-\n253004 ANC: 1234/2017/KISESA HTC: 44618061\nHTC: 44447050\nFirst name PETER PASTORY SUZANNE SUZANNE SUZANNE\nSecond name JAKKU SWAKALA LENARD JONAS JONAS\nThird name TIMOS WILLIAMS ZABRON ZABRON\nSex M F F F F\nYear of birth 2004 1984 1980 1980 1980\nMonth of birth 8 9\nDay of birth 15\nVillage KANYAMA KANYAMA KISESA Outside HDSS area IHAYABUYAGA\nSubvillage CHANGABE NYAN’HELELA KISESA KATI ILENDEJA\nResidence start\nyear 2012 2010 1995 2003 2006\nResidence end\nyear 2014 2014 2003 2006 2014\nTCL first namea HELENA MICHAEL MIZIMALLI MABINA\nTCL second\nnamea MSHIMO MALIGANYA NDALAHAWA PALO\nTCL third namea\nHH member first\nname LUZALIE JOSEPHI KOYA DOTTO\nHH member\nsecond name MATHIAS BONIFASI SAHANNI SALU\nHH member\nthird name\nTrue HDSS IDb 22341597005 77537712004 10012368001 - 10025490004\nTrue ID in fake\ninput dataset 30 98 1 - 54\nAbbreviations: ID - identifier; TCL - ten-cell leader; HH - household; HDSS - health and demographic surveillance system\naTen-cell leader: a ten-cell leader is an individual who acts as a leader for a group of ten households and these positions have been relatively stable\nover time\nbTrue HDSS ID of patient (found in fake input dataset), which is unknown in reality\ninforms the patient that her record for the older residency episode\nwas not found and asks if there was any reason why her\npersonal details would have been different. She informs the\nfieldworker she was married in 2003 and provides her maiden\nname and the name of another household member for that episode.\nThe fieldworker amends the personal details and attempts\na second search. The fieldworker now finds the top ranked record\nto have a few spelling differences, but the years of residence,\nvillage, and birth year are all the same. Additionally, the\nhousehold member is listed on the record. The fieldworker\nassigns the match to this record and ends the search as all\nreported residency episodes were found. The fieldworker saves\na match note that says, “All reported residency episodes found.”\nThe fieldworker then stores the visit date and thanks the patient\nfor his time.\nReturn visits\nWhen any of the case patients return to a linkage clinic, their\nclinic IDs when entered will retrieve the match status (in this\ncase, “Matched’; if no matches were made, “Not matched”) and\nthe saved match notes. In these cases, the fieldworker can quickly\nsee no other searches are needed and can simply store the new\nPage 7 of 15\n"
    },
    {
      "PageNumber": 8,
      "TextContent": "Gates Open Research 2018, 1:8 Last updated: 23 MAR 2022\nvisit date before thanking the patient again for their time.\nIn the event a match note stated, “Missing a record for\n2002–2007 in Kisesa Kati,” the fieldworker can focus the\ninterview to obtain the personal details that were associated\nwith that record.\nConclusions\nThe PIRL software – which combines a probabilistic\nsearch algorithm for identifying potential matches with\na relatively simple human intervention – has shown promise\nfor linking multiple data sources without a unique identifier in\nrural Tanzania. A key advantage of this software over other software\nthat employ purely automated record linkage is the ability\nto perform multiple searches for the same individual. This is of\nimportance for individuals whose records are more likely to contain\nout-of-date or inaccurate names or addresses, particularly\nfor individuals with older residency episodes and women whose\nnames change after marriage. Each search attempt on the\nHDSS database takes less than 15 seconds to complete. Excluding\ntime spent obtaining written consent, the median duration of\ntime we spend with each patient is six minutes.\nA limitation of the search database in the current implementation\nof the software is that it can only be as current as the most\nrecently completed HDSS round. In Kisesa, HDSS rounds are\nconducted for a few months roughly once per year, and extensive\ndata cleaning delays the data availability by another few\nmonths. Therefore, recent residents, such as children and adults\nwho first move into the HDSS area or infants born after the last\nHDSS round, will not have an HDSS record. The software\nallows the user to input the date of first residence in the HDSS\narea, so that these individuals can be flagged in subsequent\nanalyses. During the first 18 months of operations in Kisesa,\nwe flagged 1,576 (24.7%) patients as recent residents out of\n6,376 clinic attendees who consented to the linkage study.\nIn this setting, a purely automated retrospective approach to\nrecord linkage would have only correctly identified about half\nof the true matches and resulted in high linkage errors, therefore\nhighlighting immediate benefit of this prospective approach19.\nLinking health records to an HDSS database generates a rich\ndata source of directly observed data on access to and utilization\nof health facility services at a subnational level.\nData and software availability\nSoftware source code: https://github.com/LSHTM-ALPHAnetwork/\nPIRL_RecordLinkageSoftware\nArchived source code as at time of publication: https://doi.\norg/10.5281/zenodo.99886723\nLicense: MIT\nDue to ethical clearances, we are unable to share identifiable\nHDSS data or clinic identifiers used in our implementation\nof the software with anyone outside the study team. However,\ndemographic data only for the HDSS are available via the\nINDEPTH Network’s Sharing and Accessing Repository\n(iSHARE). Applications to access the anonymised data for\ncollaborative analysis are encouraged and can be made by\ncontacting the project coordinator for the Kisesa HDSS,\nMark Urassa (urassamark@yahoo.co.uk), or by contacting the\nALPHA Network team (alpha@lshtm.ac.uk).\nCompeting interests\nNo competing interests were declared.\nGrant information\nBill & Melinda Gates Foundation grants to the ALPHA\nNetwork [BMGF-OPP1082114] and the MeSH Consortium\n[BMGF-OPP1120138]. The Kisesa HDSS is a member of the\nINDEPTH Network and has received funding from the Global\nFund [TNZ-405-GO4-H, TNZ-911-G14-S].\nThe funders had no role in study design, data collection and analysis,\ndecision to publish, or preparation of the manuscript.\nAcknowledgements\nThe authors thank the field team for conducting the interviews\nand data collection and the participating communities. This work\nconstitutes PhD research funded by the UK Economic and Social\nResearch Council (ESRC).\nSupplementary material\nSupplementary File 1. Kisesa-HDSS record linkage user guide.\nClick here to access the data.\nSupplementary File 2. Fake input dataset with codebook.\nClick here to access the data.\nSupplementary File 3. Script to create fake input dataset.\nClick here to access the data.\nSupplementary File 4. Output datasets for case patients with codebook.\nClick here to access the data.\nPage 8 of 15\n"
    },
    {
      "PageNumber": 9,
      "TextContent": "Gates Open Research 2018, 1:8 Last updated: 23 MAR 2022\nReferences\n1. Trust W: Enabling Data Linkage to Maximise the Value of Public Health\nResearch Data: full report. 2015.\nReference Source\n2. Newcombe HB, Kennedy JM, Axford SJ, et al.: Automatic linkage of vital records.\nScience. 1959; 130(3381): 954–9.\nPubMed Abstract | Publisher Full Text\n3. Fellegi IP, Sunter AB: A Theory for Record Linkage. J Am Stat Assoc. 1969;\n64(328): 1183–210.\nPublisher Full Text\n4. Roos LL Jr, Wajda A, Nicol JP: The art and science of record linkage: methods\nthat work with few identifiers. Comput Biol Med. 1986; 16(1): 45–57.\nPubMed Abstract | Publisher Full Text\n5. Jaro MA: Probabilistic linkage of large public health data files. Stat Med. 1995;\n14(5–7): 491–8.\nPubMed Abstract | Publisher Full Text\n6. Meray N, Reitsma JB, Ravelli AC, et al.: Probabilistic record linkage is a valid\nand transparent tool to combine databases without a patient identification\nnumber. J Clin Epidemiol. 2007; 60(9): 883–91.\nPubMed Abstract | Publisher Full Text\n7. Sayers A, Ben-Shlomo Y, Blom AW, et al.: Probabilistic record linkage. Int J\nEpidemiol. 2016; 45(3): 954–64.\nPubMed Abstract | Publisher Full Text | Free Full Text\n8. Herrett E, Gallagher AM, Bhaskaran K, et al.: Data Resource Profile: Clinical\nPractice Research Datalink (CPRD). Int J Epidemiol. 2015; 44(3): 827–36.\nPubMed Abstract | Publisher Full Text | Free Full Text\n9. Smeeth L, Cook C, Fombonne E, et al.: MMR vaccination and pervasive\ndevelopmental disorders: a case-control study. Lancet. 2004; 364(9438):\n963–9.\nPubMed Abstract | Publisher Full Text\n10. Smeeth L, Thomas SL, Hall AJ, et al.: Risk of myocardial infarction and stroke\nafter acute infection or vaccination. N Engl J Med. 2004; 351(25):\n2611–8.\nPubMed Abstract | Publisher Full Text\n11. Bhaskaran K, Douglas I, Forbes H, et al.: Body-mass index and risk of 22\nspecific cancers: a population-based cohort study of 5·24 million UK adults.\nLancet. 2014; 384(9945): 755–65.\nPubMed Abstract | Publisher Full Text | Free Full Text\n12. Sankoh O, INDEPTH Network: CHESS: an innovative concept for a new\ngeneration of population surveillance. Lancet Glob Health. 2015; 3(12): e742.\nPubMed Abstract | Publisher Full Text\n13. Fure E: Interactive Record Linkage: The Cumulative Construction of Life\nCourses. Demogr Res. 2000; 3(11).\nPublisher Full Text\n14. Kum HC, Krishnamurthy A, Machanavajjhala A, et al.: Privacy preserving\ninteractive record linkage (PPIRL). J Am Med Inform Assoc. 2014; 21(2): 212–20.\nPubMed Abstract | Publisher Full Text | Free Full Text\n15. Herzog TN, Scheuren FJ, Winkler WE: Data quality and record linkage\ntechniques. Springer Science & Business Media; 2007.\nPublisher Full Text\n16. Day C: Record linkage i: evaluation of commercially available record linkage\nsoftware for use in NASS. US Department of Agriculture, National Agricultural\nStatistics Service, Research Division; 1995.\nReference Source\n17. Christen P, Churches T, Hegland M: Febrl-a parallel open source data linkage\nsystem. Lect Notes Comput Sc. 2004; 638–47.\nPublisher Full Text\n18. Jurczyk P, Lu JJ, Xiong L, et al.: Fine-grained record integration and linkage\ntool. Birth Defects Res A Clin Mol Teratol. 2008; 82(11): 822–9.\nPubMed Abstract | Publisher Full Text\n19. Rentsch CT, Reniers G, Kabudula C, et al.: Point-of-contact interactive record\nlinkage (PIRL) between demographic surveillance and health facility data\nin rural Tanzania. International Journal of Population Data Science. 2017; 2(1).\nPublisher Full Text\n20. Kabudula C, Rentsch C, Catlett J, et al.: PIRL - Point-of-contact Interactive\nRecord Linkage software. 2017.\nPublisher Full Text\n21. Kabudula CW, Clark BD, Gómez-Olivé FX, et al.: The promise of record linkage\nfor assessing the uptake of health services in resource constrained settings: a\npilot study from South Africa. BMC Med Res Methodol. 2014; 14: 71.\nPubMed Abstract | Publisher Full Text | Free Full Text\n22. Winkler WE: String Comparator Metrics and Enhanced Decision Rules in the\nFellegi-Sunter Model of Record Linkage. 1990.\nReference Source\n23. LSHTM-ALPHAnetwork: LSHTM-ALPHAnetwork/PIRL_RecordLinkageSoftware:\nInitial public release of Point-of-contact Interactive Record Linkage (PIRL)\nsoftware. Zenodo. 2017.\nData Source\nPage 9 of 15\n"
    }
  ]
}