{
    "Title": "Journal of Environmental Economics and Management 127 (2024) 103012",
    "Abstract": "",
    "Introduction": "It is widely acknowledged by the scientific community that climate change has had, and will increasingly have, significant impacts\non societies and economies worldwide. Some notable examples include the impact of climate change on economic growth ( Burke\net al., 2015 ; Newell et al. , 2018 ; Dell et al. , 2012 ), annual income ( Deryugina and Hsiang , 2014 ), labor productivity and supply ( Graff\nZivin and Neidell , 2014 ), human capital ( Graff Zivin et al. , 2018 ), demography ( Casey et al. , 2019 ), migration ( Cattaneo et al. ,\n2019 ; Desmet and Rossi-Hansberg , 2015 ), food security ( Deschênes and Greenstone , 2007 ), and energy consumption ( De Cian and\nWing , 2019 ; Isaac and Van Vuuren , 2009 ). Impacts are expected to be heterogeneous across space and households with different\nincome levels, occupations, and consumption patterns, among other characteristics. Such heterogeneity will thus affect the degree\nof inequality both within and between countries.\n✩This project has received funding from the European Union’s Horizon 2020 research and innovation programme under grant agreement No. 821124\n(NAVIGATE) and from the European Union’s Horizon Europe research and innovation program under grant agreement No 101081369 (SPARCCLE). Helpful\ncomments by Pietro Andreoni, Valentina Bosetti, Marc Fleurbaey, Simon Feindt, Jarmo Kikstra, Elmar Kriegler, Massimo Tavoni, Toon Vandyck, Franziska\nPiontek, and participants of the 2023 NAVIGATE Meeting, 2023 EMCC conference and FAERE are gratefully acknowledged.\n∗Corresponding author at: RFF-CMCC European Institute on Economics and the Environment, Italy.\nE-mail address: martino.gilli@cmcc.it (M. Gilli).\nhttps://doi.org/10.1016/j.jeem.2024.103012\nReceived 25 July 2023Journal of Environmental Economics and Management 127 (2024) 103012\n2M. Gilli et al.\nBetween countries, climate change may exacerbate inequality (Diffenbaugh and Burke, 2019) by causing heat-related impacts\nthat disproportionately affect low-income countries (Taconet et al., 2020). This vulnerability is generally linked to the geographic\nlocation of low-income countries in low latitudes with hotter temperatures (Mendelsohn et al., 2006).\nWithin countries, climate change is expected to have different effects across households. In developing countries, small-scale\nfarmers may have limited means to adapt to climate change, for example to droughts, floods, and other disasters exacerbated by\nglobal warming (see, e.g., Cohen and Dechezleprêtre (2022) for the higher vulnerability of poorer households to mortality impacts).\nThis vulnerability can lead to food insecurity, poverty, displacement, and to a widening economic gap between the rich and the poor.\nFor instance, under credit constraints, temperature shocks can hinder efficient labor reallocation (Liu et al., 2023). Additionally,\nclimate change can cause natural disasters and health risks that disproportionately affect populations already living in poverty and\ninequality, further exacerbating existing disparities.\nHowever, at the global or national level, only limited evidence has been found on within-country inequality and its link to\nweather and climate. A few exceptions include studies focusing on Vietnam (de Laubier Longuet Marx et al., 2019) and India (Sedova\net al., 2019). Therefore, the effects of temperature change on inequality within different countries remain unclear. Some studies\nlink higher climate change vulnerability to greater inequality in developing countries, with less pronounced effects in developed\nones (Cevik and Jalles, 2023), as well as increased inequality between and within communities (Hsiang et al., 2019). Preliminary\nevidence focusing on aggregate indexes suggests that global warming could lead to an increase in within-country inequality — as\nmeasured by the Gini index (Malpede and Percoco, 2021; Dasgupta et al., 2023; Paglialunga et al., 2022), or by the income share\nof the poorer half of the population, through the effects of precipitation (Palagi et al., 2022).\nThis study contributes to the existing literature by analyzing in a novel way the impact of climate change on income inequality\nwithin countries. Unlike previous studies such as Diffenbaugh and Burke (2019), which focus on between-country inequality, we\nprovide an explicit and direct measure of income inequality within countries across income deciles. We estimate three different\nclimate impact functions, using decile-level economic data and country-level climate data, to study the economic consequences of\nclimate change on the within-country income distribution.1\nResults show that the distributional consequences of climate impacts are regressive within countries, consistently for all three\ndamage function specifications (although the choice of damage function strongly influences global projected impacts). Specifically,\nthe poorest individuals within countries (those in the first decile of the income distribution) are projected to suffer the most severe\neconomic impacts of climate change. Additionally, the vulnerability to rising temperatures decreases almost monotonically across\nincome deciles within countries. Moreover, in line with the existing literature, the majority of climate damages is concentrated in the\nhotter and poorer regions of the world: those most affected by climate change are the poorest between andwithin countries . Allowing\nfor income-based adaptation, population-weighted within-country variation of climate damages accounts for almost two-thirds of\nthe variance of total damages by 2100, with the remaining variation explained by variation in damages across countries.\nThe global within-country income elasticity of damages and benefits is a summary statistic providing a simple quantification\nof the distributional implications of climate impacts. It can be used as input for other assessments, e.g., for the Social Cost of\nCarbon (Dennig et al., 2015). This value is estimated with an extensive Monte Carlo analysis, resulting in a central value of 0.64\nand a 25/75% confidence range of [0.5;0.8] for the elasticity of damages, and a central value of 1.01 [0.8;1.2] for the elasticity\nof benefits. Climate change damages are more regressively distributed in poorer and warmer countries, while benefits are captured\nslightly more by the richer deciles in advanced economies.\nThe article is organized as follows. Section 2 presents the empirical strategy estimating the impact functions by income decile.\nAfter describing the data in Section 3, Section 4 presents the results. The following sections discuss the projected damages until\n2100 (Section 5) and the income elasticity of climate impacts (Section 6), followed by the conclusions in Section 7.\n2. Empirical strategy\nThe empirical strategy employs three different impact functions from the climate econometrics literature to study the effect of\nweather variables (annual temperature and precipitation) on the growth of income across income deciles within countries. Given the\nexisting uncertainty regarding the most appropriate specification and the importance for climate damage projections, as highlighted\nin Newell et al. (2021), we consider multiple impact functions specification. These three impact functions build on Burke et al.\n(2015), Kalkuhl and Wenz (2020) and Jiao et al. (2023), respectively. We estimate them separately for each decile 𝑞= 1,…,10of\nthe (within-country) net income distribution. We model the income growth of each decile as a function of annual mean temperature,\ncumulative yearly precipitation, and other covariates, which include the usual fixed effects by country and year, as well as country-\nspecific trends. We further include among the covariates one lag of the dependent variable, as in Pretis et al. (2018), to better\naccount for the dynamics of income by decile and better isolate the effects of temperature. Note that with the large time dimension\nin our data ( 𝑇≈ 55), the bias on the lagged dependent variable coefficient in fixed effect models becomes negligible.\nThe impact function from Burke et al. (2015) (henceforth BHM) allows for a non-linear relation between temperature and output\ngrowth through the use of quadratic terms so that a marginal increase in temperature may have a differential effect in countries\nwith different climates. At the same time, this specification implicitly assumes that countries’ response to temperature changes only\ndepends on their initial temperature levels and not on other factors. Formally:\n𝛥𝑦𝑞\n𝑖𝑡=𝛥𝑦𝑞\n𝑖𝑡−1+𝛽𝑞\n1𝑇𝑒𝑚𝑝𝑖𝑡+𝛽𝑞\n2𝑇𝑒𝑚𝑝2\n𝑖𝑡+𝛾𝑞\n1𝑃𝑟𝑒𝑐𝑖𝑡+𝛾𝑞\n2𝑃𝑟𝑒𝑐2\n𝑖𝑡+𝛼𝑖+𝜃𝑡+𝜁𝑖𝑡+𝜁𝑖𝑡2+𝜖𝑖𝑡 (1)\n1We estimate the impact functions of Burke et al. (2015), Kalkuhl and Wenz (2020), and Jiao et al. (2023), as detailed below.Journal of Environmental Economics and Management 127 (2024) 103012\n3M. Gilli et al.\nwith𝑖and𝑡indexing country and year, respectively. 𝑦𝑖𝑡is the real per capita income of decile 𝑞in logarithm. 𝛥is the first-difference\noperator,𝑇𝑒𝑚𝑝𝑖𝑡is the annual average temperature, and 𝑃𝑟𝑒𝑐𝑖𝑡is annual cumulative precipitation,2𝛼𝑖and𝜃𝑡are country- and\nyear-fixed effects, 𝜁𝑖𝑡and𝜁𝑖𝑡2are linear and quadratic country-specific time trends.\nThe impact function from Kalkuhl and Wenz (2020)3(henceforth KW) for the decile 𝑞is:\n𝛥𝑦𝑞\n𝑖𝑡=𝛥𝑦𝑞\n𝑖𝑡−1+𝛽𝑞\n0𝛥𝑇𝑒𝑚𝑝𝑖𝑡+𝛽𝑞\n1𝛥𝑇𝑒𝑚𝑝𝑖𝑡−1+𝛽𝑞\n2𝛥𝑇𝑒𝑚𝑝𝑖𝑡∗𝑇𝑒𝑚𝑝𝑖𝑡−1+𝛽𝑞\n3𝛥𝑇𝑒𝑚𝑝𝑖𝑡−1∗𝑇𝑒𝑚𝑝𝑖𝑡−1\n+𝜆𝑞\n0𝛥𝑃𝑟𝑒𝑐𝑖𝑡+𝜆𝑞\n1𝛥𝑃𝑟𝑒𝑐𝑖𝑡−1+𝜆𝑞\n2𝛥𝑃𝑟𝑒𝑐𝑖𝑡∗𝑃𝑟𝑒𝑐𝑖𝑡−1+𝜆𝑞\n3𝛥𝑃𝑟𝑒𝑐𝑖𝑡−1∗𝑃𝑟𝑒𝑐𝑖𝑡−1\n+𝜙𝑞\n1𝑃𝑟𝑒𝑐𝑖𝑡−1+𝜙𝑞\n2𝑃𝑟𝑒𝑐2\n𝑖𝑡−1+𝜁𝑞\n1𝑇𝑒𝑚𝑝𝑖𝑡−1+𝜁𝑞\n2𝑇𝑒𝑚𝑝2\n𝑖𝑡−1+𝛼𝑖+𝜃𝑡+𝛿𝑖𝑡+𝜖𝑖𝑡 (2)\nAs in BHM, this modeling choice allows for heterogeneous impacts of temperature shocks across different climates without\nadditional forms of heterogeneity. Moreover, it allows weather variables to have both a level effect on aggregate output from the\nterms in first difference (i.e. a temporary effect on the growth rate of output) and a growth effect from the terms in levels (i.e. a\npermanent effect on the growth rate of output).\nNext, we consider the possibility that income alters the responsiveness of growth to the local climate, as in Jiao et al. (2023).4\nBy observing damages from temperature shocks, we can infer that adaptation to climate shocks is costly. Higher income relaxes\nthe budget constraint under which economic agents undertake the optimal adaptation decision. Hence, the wealthier an agent is,\nthe more they can invest in adaptation to insulate themselves from climate impacts. This simple theoretical hypothesis guides the\nempirical specification of the impact function, which allows for income-driven adaptation. In an extension of Burke et al. (2015), we\ninteract each term of the quadratic functions of temperature and precipitations with 𝑦𝑖𝑡−1, the lagged country-level log of GDP per\ncapita of country 𝑖. This can capture private adaptive capacity, allowing investment into proactive or reactive adaptation measures,\nbut also public adaptation measures. We refer to this model specification as BHM-Adaptation. This is our preferred specification\nand the one we focus on when presenting our main results in Sections 4 and 5, while showing that the main takeaways regarding\nthe distributional consequences of projected climate impacts are robust to the choice of the damage function.\n𝛥𝑦𝑞\n𝑖𝑡=𝛥𝑦𝑞\n𝑖𝑡−1+𝑇𝑒𝑚𝑝𝑖𝑡(𝛽𝑞\n1+𝛽𝑞\n3𝑦𝑖𝑡−1) +𝑇𝑒𝑚𝑝2\n𝑖𝑡(𝛽𝑞\n2+𝛽𝑞\n4𝑦𝑖𝑡−1) +𝑃𝑟𝑒𝑐𝑖𝑡(𝛾𝑞\n1+𝛾𝑞\n3𝑦𝑖𝑡−1) (3)\n+𝑃𝑟𝑒𝑐2\n𝑖𝑡(𝛾𝑞\n2+𝛾𝑞\n4𝑦𝑖𝑡−1) +𝛼𝑖+𝜆𝑡+𝛿𝑖𝑡+𝜖𝑖𝑡\nThe hypothesis is that income mitigates damages caused by deviations from the optimal temperature, and we expect that 𝛽3\nand𝛽4have opposite signs to 𝛽1and𝛽2, respectively. Given that GDP per capita is always positive, the higher a country’s average\nincome is, the flatter its temperature response function will be, and vice versa.\nHence, this reduced-form specification can capture, for example, the kind of adaptation that takes place by re-allocating\nproduction to sectors less exposed to the higher temperature’s negative impacts on productivity (see e.g.Somanathan et al. (2021)),\nor by investing in protective technologies such as air conditioning (Barreca et al., 2015). This extension of the polynomial damage\nfunction specification allowing for income-driven adaptation follows (Carleton et al., 2022), who apply a similar strategy to the\nmortality impacts of daily temperatures.5Jiao et al. (2023) show how outlier observations in the dependent variable of interest can\ndistort OLS coefficients because some identifying variation in the dependent variable may be erroneously attributed to variation\nin the climate variables of interest, thus biasing the coefficients on those variables, despite the presence of fixed effects and other\ncontrols. Because of this, we present in Section A.1 results for the decile-level BHM-adaptation damage function estimated with OLS\ndropping the top and bottom 1% of outliers, as well as using the Impulse Indicator Saturation (IIS) estimator proposed in Santos\net al. (2008). The sign and size of the coefficients are robust, but come at a cost in precision, especially for the lower deciles, leading\nus to rely on the full-sample results when presenting the projected distributional consequences of climate impacts.\nIn addition to the decile-level damage functions, we estimate the country-level corresponding functions, with the same\nexplanatory variables and where the dependent variable is 𝛥𝑦𝑖𝑡, the growth of real per capita GDP in country 𝑖and year𝑡.\nTo summarize, we estimate a separate set of coefficients for each income decile. We evaluate how the ten deciles of net income\ndistribution respond to the same country-level variations in annual temperature. The distributional consequences of climate change\nwithin each country will then depend on the relative slopes of the impact function among each decile. Income inequality will worsen\ndue to climate change if the impact functions for lower deciles, evaluated at the country’s current climate, have a steeper negative\nslope than the upper deciles of the income distribution, and vice versa. When presenting our decile-level results on the impact\nof temperatures on decile income growth in Sections 4 and 5, we focus especially on the findings from the estimation of Eq. (3).\nIn Section 6 we show that our main findings on the distribution of climate impacts within countries hold across all three impact\nfunction specifications from the literature.\n2Whereas Kotz et al. (2022) also include extreme indices of climate in the framework of Kalkuhl and Wenz (2020), their results suggest that the largest part\nof impacts can indeed be captured by annual mean temperature. Hence we focus on these aggregate values here.\n3We consider column (5) from Table 4 in Kalkuhl and Wenz (2020), as this is indicated as the preferred panel specification in the paper and the one used\nfor climate impact projections\n4A similar specification is also examined in Burke et al. (2015), Extended Data figure 1, but with an interaction for the linear temperature term only.\n5We show in Section A.1 that our results are robust to considering the average per capita GDP over the sample period, a rolling average of 10 or 15 years\nfor̄ 𝑦𝑖, as well as to excluding precipitation controls or allowing for quadratic trends.Journal of Environmental Economics and Management 127 (2024) 103012\n4M. Gilli et al.\nTable 1\nSummary statistics.\nName Mean Min Max SD\n1 Log(GDP pc) 8.20 5.11 11.63 1.43\n2 GDP pc growth 0.02 −1.03 0.68 0.06\n3 1st decile, share in % 2.21 0.00 5.36 0.98\n4 2nd decile 3.66 0.18 7.21 1.30\n5 3rd decile 4.67 0.21 8.07 1.40\n6 4th decile 5.66 0.56 8.96 1.42\n7 5th decile 6.71 1.58 9.82 1.38\n8 6th decile 7.92 2.44 10.78 1.29\n9 7th decile 9.47 4.05 12.50 1.11\n10 8th decile 11.66 6.17 14.64 0.83\n11 9th decile 15.41 10.85 19.49 0.86\n12 10th decile 32.70 13.74 70.95 8.89\n13 Annual temperature (◦C) 18.02 −3.47 29.98 7.68\n14 Annual precipitation (mm) 91.22 0.83 356.52 55.93\n3. Data\nTemperature and precipitation data come from the Climate Research Unit at the University of East Anglia. We aggregate gridded\nmonthly average temperature and precipitation with 0.5◦resolution using population weights at the same resolution from the\nSocioEconomic Data and Applications Center (SEDAC) at Columbia University, accounting for cells that are only partially covered\nby a country’s borders and for the area extent of each pixel. This is done computing the weights 𝑤for each grid cell belonging to\na country according to the formula 𝑤𝑗,𝑖=𝑐𝑗,𝑖∗𝑎𝑗,𝑖∗𝑝𝑗,𝑖, where𝑐𝑖is the fraction of the cell 𝑗that falls within country 𝑖’s borders,\n𝑎𝑗,𝑖is the area in km covered by the grid-cell (this changes across latitudes) and 𝑝𝑗,𝑖is the population count/km in the cell. The\nmonthly series are then aggregated to the annual level in order to match the macroeconomic indicators.\nGDP growth data comes from World Bank’s Development Indicators, calculated from GDP per capita in constant 2015 USD.\nDecile-level income is reconstructed from decile-level income shares data described and assembled in Narayan et al. (2023b) and\nslightly updated in Narayan et al. (2023a). The authors combine publicly available data on the deciles of the within-country\ndistribution of net income (post-tax, disposable) from the UNU Wider World Income Inequality Database (WIID), with data on\ndeciles for consumption, and country-level Gini data from the World Bank’s World Development Indicators. Briefly, they impute the\nmissing values for income deciles with the predicted values coming from (i) consumption data when available (predicted through\nOLS), and (ii) Gini data through Principal Component Analysis. This yields an almost balanced panel dataset, in contrast to a strongly\nunbalanced WIID. We compute decile-level income levels multiplying decile-level income share by GDP per capita. The analysis is\nperformed on unbalanced data (because of missing Gini or GDP data) from 1960 to 2015. Table 1 presents the summary statistics\nof the variables we use for our empirical specifications.\nProjections follow the combined Shared Socioeconomic Pathways (SSPs) for country-level socioeconomic variables (Population\nand GDP) (Riahi et al., 2017). We use as a reference the SSP3 scenario, which follows current trends in regional rivalries and\nconflicts, assuming reversal in globalization trends (O’Neill et al., 2017). SSP2 is explored as a robustness check (see Section A.5). We\ncompare this scenario without climate impacts to the same projected per-capita GDP after applying climate impacts from temperature\nincreases. The impacts are based on the damage coefficients estimated in Section 4. Since the regression coefficients for precipitation\nare imprecisely estimated and its future projections are not reliable, we focus our analysis on the effects of temperature, in line with\nthe existing literature.\nTo create our baseline scenario under SSP3 with no climate impacts, we use the RICE50+ model, described in detail in Gazzotti\n(2022). The model is an extension of Nordhaus’s seminal DICE model (Nordhaus, 2017) and features 154 countries. Temperature is\ndownscaled to the country level based on the CMIP6 model ensemble (Eyring et al., 2016). The model includes projections for total\nGDP and population at the country level as well as projections on decile-level income, depending on the SSP scenario. The main\nscenario we consider when presenting our results sees GDP growing under the SSP3 scenario, thus yielding temperatures similar to\nthe high-emission RCP 7.0 scenario. Indeed, the global average increase in surface temperature is around 3.6◦Cby 2100 under this\nscenario relative to preindustrial (Appendix Figure A.5).\n4. Empirical results\nEstimates from Eq. (3) (BHM-Adaptation) confirm that country-level income plays a crucial role in reducing vulnerability to\nclimate damages. In addition, the poorer deciles are more affected by climate, furthering within-country inequalities. The estimated\ncoefficients are presented in Table 2.\nNotably, two key factors contribute to larger damages in lower-income countries. First, the damage function of lower-income\ncountries exhibits a steeper curve. This implies that marginal damages grow faster in poorer countries as temperatures deviate\nfrom the optimal level in a warming world. An inverted-U damage function, consistently with previous studies (e.g., Burke et al.\n(2015)), becomes less pronounced as GDP increases. This reduced sensitivity of economic growth between countries results fromJournal of Environmental Economics and Management 127 (2024) 103012\n5M. Gilli et al.\nTable 2\nDamage functions, with BHM-adaptation.\nDependent variables: Decile income growth GDP pc growth\nModel: (1) (2) (3) (4) (5) (6) (7) (8) (9) (10) (11)\nVariables\nTemperature 0.1657∗∗∗0.1390∗∗∗0.1375∗∗∗0.1356∗∗∗0.1304∗∗∗0.1281∗∗∗0.1275∗∗∗0.1288∗∗∗0.1278∗∗∗0.1180∗∗∗0.1329∗∗∗\n(0.0621) (0.0399) (0.0352) (0.0317) (0.0287) (0.0268) (0.0252) (0.0238) (0.0227) (0.0237) (0.0237)\nTemperature, Squared −0.0045∗∗−0.0032∗∗−0.0033∗∗∗−0.0033∗∗∗−0.0032∗∗∗−0.0031∗∗∗−0.0031∗∗∗−0.0031∗∗∗−0.0031∗∗∗−0.0028∗∗∗−0.0032∗∗∗\n(0.0021) (0.0014) (0.0012) (0.0011) (0.0009) (0.0009) (0.0008) (0.0008) (0.0007) (0.0008) (0.0008)\nTemperature ×GDP(𝑡− 1) −0.0152∗∗−0.0124∗∗∗−0.0126∗∗∗−0.0124∗∗∗−0.0122∗∗∗−0.0120∗∗∗−0.0120∗∗∗−0.0122∗∗∗−0.0121∗∗∗−0.0107∗∗∗−0.0126∗∗∗\n(0.0063) (0.0040) (0.0036) (0.0032) (0.0030) (0.0028) (0.0026) (0.0025) (0.0024) (0.0026) (0.0025)\nTemperature Sq. ×GDP(𝑡− 1) 0.0004∗0.0003∗0.0003∗∗0.0003∗∗0.0003∗∗∗0.0003∗∗∗0.0003∗∗∗0.0003∗∗∗0.0003∗∗∗0.0003∗∗∗0.0003∗∗∗\n(0.0002) (0.0002) (0.0001) (0.0001) (0.0001) (0.0001) ( 9.43 × 10−5) ( 8.9 × 10−5) ( 8.59 × 10−5) ( 9.57 × 10−5) ( 8.81 × 10−5)\nFixed-effects\nCountry Yes Yes Yes Yes Yes Yes Yes Yes Yes Yes Yes\nYear Yes Yes Yes Yes Yes Yes Yes Yes Yes Yes Yes\nVarying Slopes\nYear (Country) Yes Yes Yes Yes Yes Yes Yes Yes Yes Yes Yes\nFit statistics\nObservations 5,551 5,551 5,551 5,551 5,551 5,551 5,551 5,551 5,551 5,551 5,551\nR20.09430 0.09704 0.10928 0.13340 0.16973 0.20311 0.24298 0.27602 0.27332 0.14926 0.30600\nWithin R20.06357 0.02177 0.02327 0.03068 0.03692 0.04902 0.06888 0.08896 0.08365 0.04845 0.11574\nClustered (Country) standard-errors in parentheses .\nSignif. Codes: ***: 0.01, **: 0.05, *: 0.1 .\nNote: Regressions of decile income growth (columns 1 through 10) and GDP per capita growth (column 11) on a function of temperature and income. All regressions also include precipitation, squared precipitation, and their\ninteraction with lagged income levels.\nthe interaction terms of lagged income with linear and quadratic temperature, with these terms exhibiting opposite signs of the non-\ninteracted temperature terms for all deciles. To illustrate this, Fig. 1 displays the decile-level and country-level damage functions at\nvarious income levels for a hypothetical low-income country (25th percentile of per capita GDP observations in the sample, 1300\nUSD), a middle-income country (50th percentile, 3463 USD), and a high-income country (75th percentile, 12968 USD). Confidence\nintervals are excluded in the figure for visual clarity, and they are reported in Figure A.2 in the Appendix. Results do not appear to\nbe artifacts of the reconstruction of income shares in Narayan et al. (2023a) (Section A.1 in Appendix).\nSecond, current temperatures are already further above the optimal temperature in poorer countries than they are in richer ones.\nThe optimal temperature estimated from the decile-level regressions across income levels of countries is around 18◦C (although it\nvaries slightly across deciles), higher than the optimal levels of Burke et al. (2015) (13◦C) and Kalkuhl and Wenz (2020) (5◦C). Low-\nincome countries are on average warmer meaning that, assuming a quadratic damage functions, a marginal increase in temperatures\nleads to proportionally larger losses in output growth.\nThe impacts are also unequal within countries. As plotted in Fig. 1 and implied by the coefficients of Table 2, the damage\nfunctions show that the income of poorer households is more responsive to temperature changes regardless of GDP levels. In addition\nto this, we also see that the responsiveness to temperature appears to decrease almost monotonically across income deciles.\nTo summarize, the sensitivity of income to climate decreases along the income distribution both between and within countries.\nThe within variation is the key result underpinning Sections 5 and 6 on the distributional consequences of climate change impacts.\n5. Projected distributional impacts\nThe previous section highlighted the distributional effects of climate change estimated over the past half-century, within and\nbetween countries. However, it remains unclear what the future distributional implications will be. On the one hand, increasing\ntemperatures will damage GDP growth; on the other hand, higher income levels will increase adaptive capacity. We, therefore,\nproject damages to the end of the century and explore the distributional implications within and between countries.\nWe project GDP and temperature using the RICE50+ model (Gazzotti, 2022). Decile-level income is reconstructed from projected\ndecile shares (Narayan et al., 2023b) and GDP. Impacts for each decile 𝑞in time𝑡are then defined as the difference between the\nprojected income per capita 𝑦𝑞\n𝑖𝑡with climate impacts and counterfactual income per capita ̃ 𝑦𝑞\n𝑖𝑡without impacts6:\n𝑑𝑞\n𝑖𝑡=̃ 𝑦𝑞\n𝑖𝑡−𝑦𝑞\n𝑖𝑡. (4)\nThe counterfactual ̃ 𝑦𝑞\n𝑖𝑡is constructed letting income of decile 𝑞in year𝑡and country 𝑖evolve according to:\ñ 𝑦𝑞\n𝑖𝑡= (1 +𝑔𝑞\n𝑖𝑡)̃ 𝑦𝑞\n𝑖𝑡−1(5)\nwhere𝑔is the counterfactual growth rate under no climate impacts from the SSPs. Income with climate impacts is\n𝑦𝑞\n𝑖𝑡= (1 +𝑔𝑞\n𝑖𝑡+𝛿𝑞\n𝑖𝑡)𝑦𝑞\n𝑖𝑡−1(6)\nwith𝛿𝑞\n𝑖𝑡is the estimated climate impact factor, which differs across impact function specifications. It represents the reduction or\nincrease in economic growth rate caused by deviations from the optimal temperature. Under the BHM specification, 𝛿𝑞\n𝑖𝑡is:\n𝛿𝑞,𝐵𝐻𝑀\n𝑖𝑡=̂𝛽1𝑞(𝑇𝑒𝑚𝑝𝑖𝑡−𝑇𝑒𝑚𝑝𝑖0) +̂𝛽2𝑞(𝑇𝑒𝑚𝑝2\n𝑖𝑡−𝑇𝑒𝑚𝑝2\n𝑖0) (7)\n6Analogously, country-level damages are defined as∑\n𝑞𝑑𝑞\n𝑖𝑡=∑\n𝑞(̃ 𝑦𝑞\n𝑖𝑡−𝑦𝑞\n𝑖𝑡).Journal of Environmental Economics and Management 127 (2024) 103012\n6M. Gilli et al.\nFig. 1. Damage functions at the decile level. D1toD10 indicate deciles from the poorest to the richest. GDP indicates the country-level damage functions.\nDecile-level damage functions with income-driven adaptation for three selected countries at different income levels. The shape of the function varies with the\nincome level both within and between countries. Confidence intervals have been omitted for visual clarity; they are reported in Figure A.2 in the Appendix. Low\nincome : 25th percentile of the GDP per capita distribution in the sample, 1,300 USD per capita. Middle income : 50th percentile, 3,463 USD. High income : 75th\npercentile, 12,968 USD.\nUnder the KW specification, it is:\n𝛿𝑞,𝐾𝑊\n𝑖𝑡=̂𝛽0𝑞𝛥𝑇𝑒𝑚𝑝𝑖𝑡+̂𝛽1𝑞𝛥𝑇𝑒𝑚𝑝𝑖𝑡−1+̂𝛽2𝑞𝛥𝑇𝑒𝑚𝑝𝑖𝑡∗𝑇𝑒𝑚𝑝𝑖𝑡−1+̂𝛽3𝑞𝛥𝑇𝑒𝑚𝑝𝑖𝑡−1∗𝑇𝑒𝑚𝑝𝑖𝑡−1 (8)\nUnder the BHM-Adaptation specification, it is:\n𝛿𝑞,𝐵𝐻𝑀 −𝐴𝑑𝑎𝑝𝑡𝑎𝑡𝑖𝑜𝑛\n𝑖𝑡= (𝑇𝑒𝑚𝑝𝑖𝑡−𝑇𝑒𝑚𝑝𝑖0)(̂𝛽𝑞\n1+̂𝛽𝑞\n3𝑦𝑖𝑡−1) + (𝑇𝑒𝑚𝑝2\n𝑖𝑡−𝑇𝑒𝑚𝑝2\n𝑖0)(̂𝛽𝑞\n2+̂𝛽𝑞\n4𝑦𝑖𝑡−1) (9)\nwhere𝑇𝑒𝑚𝑝𝑖0is temperature in country 𝑖in 2015 and 𝑦𝑖𝑡−1is the lagged GDP per capita under climate impacts in logarithms. Note\nthe compounding of effects: climate change may reduce income levels and thus the ability to adapt, causing larger relative damages.\nThe projected impacts across damage functions are of the same order of magnitude. In 2100, under a RCP 7.0 warming scenario,\nglobal impacts on per capita GDP are projected at around 9% of GDP under the BHM specification, 7.5% under the BHM-Adaptation\nspecification and about 2.4% of GDP under the KW specification (when estimated with country-level data instead of the original\nsub-national level data).7We report the estimated global impacts over time for all damage function specifications, as implied by our\nempirical results, in Figure A.6 in Section A.6, where we also explain some discrepancies with previous results on global projected\nimpacts.\nDistributional effects are shown by Fig. 2 , which displays projected climate impacts as a share of income across income deciles\nunder the BHM-Adaptation specification. Median impacts are negative and similar for all deciles but the richest one. However, the\nimpacts range and variance across countries is larger for the lower deciles. The negative and regressive effect of climate change is\nconsistent across the three damage functions (Figures A.8 and A.9 in Appendix).\nGlobally, climate impacts are more regressive in hotter and poorer countries. Fig. 3 displays how the projected regressive damages\nvary across countries. Panel (a) plots the difference between the relative impacts (impacts as a share of income) of the lowest and\nthe highest decile. Hence, a higher value implies that poorer strata are more exposed to climate impacts.8In other words, the more\nstrongly regressive consequences will come in the currently hotter and poorer parts of the world, as implied by Fig. 1. The impact\ngap between the top and bottom decile is especially marked in Sub-Saharan Africa, the Middle East, South Asia, as well as parts of\nLatin America.\nFig. 3b displays the consequences for the Gini index by country of our projected decile-level climate impacts under the SSP3\nscenario, implying warming of +3.6◦C by 2100. Consistently with the findings in panel (a), higher starting temperatures are\nprojected to increase within-country inequality, as measured by the Gini index, for basically every country in the world. The stronger\nnegative consequences for an equal distribution of income within countries are again projected to be seen in Sub-Saharan Africa\nand the Middle East, with a projected increase of up to 6 points in the index. This is broadly consistent with the previous findings\nin Malpede and Percoco (2021 ), Paglialunga et al. (2022 ) and Cevik and Jalles (2023 ), despite the different econometric models\nused.\n7In Figure A.11 in Section A.8, we display projected damages across four SSP-RCP scenarios for all three damage functions.\n8in Figure A.7 in Section A.7 we display projected damages in 2100 to per capita income for all deciles in all countries, for completenessJournal of Environmental Economics and Management 127 (2024) 103012\n7M. Gilli et al.\nFig. 2. Projected decile-level impacts in 2100 under SSP3 scenario, with a climate sensitivity equal to 1. Each dot represents the projected impact on decile-level\nincome for a given income decile in one of the 154 countries of RICE50+. Dot placement is slightly perturbed for visualization purposes. Horizontal orange lines\nmark the medians of the distribution, for each decile, of projected impacts across regions. (For interpretation of the references to color in this figure legend, the\nreader is referred to the web version of this article.)\nFig. 3. Distributional effects of climate damages by 2100 under SSP3 and BHM-Adapt damages. Panel (a): differences in damages as a share of income between\nD1 and D10. Panel (b): impact of climate change on the Gini index.\nTherefore, climate change is estimated to have adverse distributional consequences in the future, globally worsening within-\ncountry inequality across the century. The next section estimates the income elasticity of climate impacts to provide a summary\nmeasure for this effect.\n6. The income elasticity of climate impacts\nThe income elasticity of climate impacts – how responsive relative damages are to a change in income along the within-country\nincome distribution – has important implications for poverty, for political economy considerations, and, ultimately, for the socially\noptimal climate policy and the Social Cost of Carbon ( Dennig et al. , 2015 ). The income elasticity 𝜉is defined by the relationship\n𝑑𝑞\n𝑖𝑡∝(̃ 𝑦𝑞\n𝑖𝑡)𝜉. (10)\nImpacts are proportional to income ( i.e.,distribution-neutral) if 𝜉= 1, and fall disproportionately on the poor when 𝜉 <1and\non the rich when 𝜉>1.\nWe estimate the within-country income elasticity of climate impacts until 2100 using a standard log–log regression of decile-based\nimpacts on per capita income level ( Eqs. (11) and (12)). We use a fixed effects model, whereby we include a full set of country-year\nfixed effects. This allows us to identify the elasticity relying on variation within a country-year combination.\nSome countries and deciles could experience benefits from higher temperatures if their climates start from a temperature to the\nleft of the estimated optimal temperature. Therefore, climate impacts can be both positive (i.e. benefits) or negative (i.e. damages).Journal of Environmental Economics and Management 127 (2024) 103012\n8M. Gilli et al.\nTable 3\nIncome elasticity of climate impacts.\nDamages Benefits\nBHM-Adapt BHM KW BHM-Adapt BHM KW\nMean estimate 0.64 0.76 0.60 1.01 1.15 1.13\nFull uncertainty IQR [0.51, 0.75] [0.63, 0.83] [0.53, 0.61] [0.78, 1.21] [0.86, 1.34] [0.91, 1.29]\nFull uncertainty 95% range [0.37, 1.11] [0.51, 1.43] [0.45, 1.18] [0.46, 1.73] [0.64, 2.22] [0.72, 1.9]\nEconometric uncertainty 𝜎 0.22 0.26 0.17 0.32 0.44 0.29\nClimate uncertainty 𝜎 0.07 0.07 0.03 0.26 0.19 0.18\nFull uncertainty 𝜎 0.20 0.22 0.16 0.34 0.40 0.30\nWithin-country income elasticity of climate impacts under SSP3 from the Monte Carlo analysis. Temperature is projected, drawing 500 climate sensitivities\nfrom a𝐿𝑜𝑔𝑛𝑜𝑟𝑚𝑎𝑙 (1.1,0.3), while 500 damage function parameters are drawn from empirical multivariate normal distributions characterized by the covariance\nestimated in Section 4. Mean estimate are averages across all simulations, encompassing both climate model and statistical uncertainty. The Full uncertainty IQR\nandFull uncertainty 95% range indicate the interquartile range (IQR) and the 95% coverage range across all simulations, encompassing both climate model and\nstatistical uncertainty. The Econometric uncertainty 𝜎indicates the standard deviation of the within-country income elasticity of climate impacts across Monte\nCarlo simulations in which the climate sensitivity is fixed at 3. The Climate uncertainty 𝜎indicates the standard deviation of the within-country income elasticity\nof climate impacts across Monte Carlo simulations in which damage function parameters are fixed at point estimates. The Full uncertainty 𝜎is the uncertainty\nfrom the full set of Monte Carlo results.\nTo estimate a meaningful income elasticity, we split the data and separately estimate the income elasticity of damages ( 𝜉−) and the\nincome elasticity of benefits ( 𝜉+) according to:\n𝑙𝑛(-𝑑𝑞−\n𝑖𝑡)=𝛼−\n𝑖+𝜉−𝑙𝑛(̃𝑦𝑞\n𝑖𝑡)+𝜙−\n𝑖𝑡+𝜖𝑞−\n𝑖𝑡(11)\n𝑙𝑛(𝑑𝑞+\n𝑖𝑡)=𝛼+\n𝑖+𝜉+𝑙𝑛(̃𝑦𝑞\n𝑖𝑡)+𝜙+\n𝑖𝑡+𝜖𝑞+\n𝑖𝑡(12)\nHere,𝑑𝑞−are climate damages and 𝑑𝑞+are climate benefits, 𝜙⋅\n𝑖𝑡denotes a set of country-year fixed effects and 𝜖𝑞⋅\n𝑖𝑡a random error\nterm.\nBoth elasticities imply progressivity of impacts for values greater than 1 and regressivity for values smaller than 1. It should\nbe noted, however, that 𝜉+>1is progressive from a mathematical perspective, but otherwise socially regressive: benefits are\ndisproportionately enjoyed by the wealthier deciles.9\nTo better characterize the evolution of climate impacts, we explore the climate model and econometric uncertainty with a Monte\nCarlo simulation. To explore climate uncertainty, we simulate climate trajectories under different equilibrium climate sensitivities\n(ECS). We draw 500 climate sensitivities from a 𝐿𝑜𝑔𝑛𝑜𝑟𝑚𝑎𝑙 (1.1,0.3), which has a 66% (17%–83%) range for sensitivity of 2.2-3.9\nK per doubling of atmospheric carbon dioxide, in line with the current understanding of the ECS (Sherwood et al., 2020). Given\nthe climate sensitivity, we reconstruct a global temperature projection using the climate module within RICE50+ (Figure A.5). The\nRICE50+ climate module is a three-layer carbon and two-layer temperature model, adjusted in its exchange coefficients to match\nthe MAGICC6 model emulation (Meinshausen et al., 2011). The econometric uncertainty is derived drawing at random 500 values\nfrom a multivariate normal distribution with the covariance estimated in Section 4. Finally, for each specification (drawn from the\nparameter space) and temperature projection, we reconstruct the evolution of income with impacts 𝑦𝑞\n𝑖𝑡and𝑑𝑞\n𝑖𝑡. That is, we compute\n250,000 elasticities for each damage function and for each SSP scenario. Results for SSP2 are similar and shown in the Appendix.\nFig. 4 shows the distribution of within-country income elasticities, and Table 3 provides summary statistics. While global\nprojected damages are sensitive to the choice of the damage function as shown in Newell et al. (2021) and in Figure A.6, the\nincome elasticity of climate impacts is consistent across the three specifications. The damages from climate change are projected to\nbe disproportionately borne by poorer deciles. The mean income elasticity of damages is estimated at 0.64 under BHM-Adaptation,\n0.76 under the BHM specification, and 0.60 under the KW specification, with the 75th percentile of the distribution substantially\nbelow 1 for all specifications. The income elasticity of climate benefits has a comparatively wider distribution, the central estimate\nof which is close to distribution neutrality. The mean estimate of 𝜉+is 1.01 for BHM-Adaptation, 1.15 for BHM, and 1.13 for KW.\nThe existing literature offers some, yet limited, comparisons. Mendelsohn et al. (2012) find an income elasticity of 0.42 for\ndamages from tropical cyclones. For some impacts, the elasticity could even be negative (Tol, 2021), while an average elasticity\nof damages of 1 (proportional damages) has also been used (Anthoff and Tol, 2012; Dietz et al., 2018). Therefore, our results fall\nwithin a range that is compatible with previous work on the topic.\nWe then explore heterogeneity in elasticities above and below median GDP in Table 4, and above and below median temperatures.\nProjections use the point estimates of Eq. (3) and temperature projections with an ECS of 3. Damages are more regressive in poorer\ncountries (those with a below-median per capita GDP, 𝜉−= 0.51) as well as in hotter countries (those with above median annual\ntemperature, 𝜉−= 0.47). Benefits are more disproportionally enjoyed by the higher deciles in richer ( 𝜉+= 1.43) and warmer\n9Dennig et al. (2015) use a slightly different definition of relative terms writing𝑑𝑞\n𝑖𝑡\n𝑑𝑖𝑡=𝑎𝑖(̃ 𝑦𝑞\n𝑖𝑡\ñ 𝑦𝑖𝑡)𝜉. While we could estimate this equation based on decile shares\nwithout fixed effects and identify within-country effects, the results are slightly different due to the non-linear transformation. In addition, the relative terms\nformulation raises questions on how to deal with climate benefits, not originally considered in Dennig et al. (2015). We thank an anonymous referee for pointing\nus to the differences between the two definitions.Journal of Environmental Economics and Management 127 (2024) 103012\n9M. Gilli et al.\nFig. 4. Distribution of the within-country income elasticity of climate impacts under SSP3 from the Monte Carlo analysis. Temperature is projected, drawing 500\nclimate sensitivities from a 𝐿𝑜𝑔𝑛𝑜𝑟𝑚𝑎𝑙 (1.1,0.3), while 500 damage function parameters are drawn from empirical multivariate normal distributions characterized\nby the covariance estimated in Section 4.Full uncertainty is the uncertainty from the full set of Monte Carlo results. Climate uncertainty is the uncertainty\nstemming from the variation in climate sensitivity. Econometric uncertainty is the uncertainty from the damage function parameters. Vertical black bars indicate\nthe average values; gray bars indicate the average values of other specifications for reference. (For interpretation of the references to color in this figure legend,\nthe reader is referred to the web version of this article.)\nTable 4\nHeterogeneity in income elasticity of climate impacts, under the BHM-Adaptation specification.\nLog(Impacts)\nDamages Benefits\n(1) (2) (3) (4) (5) (6) (7) (8)\n<median GDP >median GDP <median temp. >median temp. <median GDP >median GDP <median temp. >median temp.\nLog(Income) 0.51∗∗∗0.68∗∗∗0.87∗∗∗0.47∗∗∗1.29∗∗∗1.43∗∗∗1.37∗∗∗2.85∗∗∗\n(0.01) (0.02) (0.02) (0.01) (0.02) (0.03) (0.02) (0.10)\nCountry-Year FE Y Y Y Y Y Y Y Y\nObservations 10 413 9424 7636 12 201 2167 3156 4944 379\n𝑅20.62 0.30 0.38 0.55 0.71 0.55 0.60 0.96\nAdjusted𝑅20.62 0.30 0.38 0.55 0.71 0.55 0.60 0.96\nIncome elasticity of climate impacts using point estimates of BHM-Adaptation and standard temperature projections. HC3 standard errors in parentheses.∗𝑝 < 0.1;∗∗𝑝 < 0.05;∗∗∗𝑝 < 0.01.\n(𝜉+= 2.85) countries, although we suggest caution in the interpretation of the latter figure as only few deciles in warm countries\nexperience climate benefits.\nThe heterogeneity of climate impacts can be further unpacked, by decomposing the variance of the projected impacts at the\ndecile-country level in 2100. About 60% of the population-weighted variance of climate damages (in per capita terms) happens\nwithin countries, while the remainder happens between them. Conversely, only about a fourth of the population-weighted variance\nof climate benefits happens within countries. Fig. 5 visually explore the decomposition. The lower Panel (C) compares projected\nrelative damages𝑑𝑞\n∑\n𝑞𝑑𝑞for all decile-country observations in 2100 (that is, ten observations per country) against relative income\n𝑦𝑞\n∑\n𝑞𝑦𝑞, after removing year fixed effects. Panel (A) highlights the within-country comparison, after removing country-year fixed\neffects. Panel (B) aggregates damages and income to depict the variation in impacts across countries.\n7. Conclusion\nThe results consistently show that climate change will increase within-country inequality. We first empirically investigate how\ntemperature affects decile-level income, finding that the sensitivity of income to climate decreases along the income distribution,\nboth between and within countries. We employ three different damage functions, with our preferred specification allowing for\nincome-led adaptation. Second, we project future climate impacts and find that damages fall, within countries, more heavily on\nthe poorest deciles. Third, the distributional implications of climate impacts are summarized by the income elasticities of climate\ndamages and benefits. The central estimates imply regressive climate damages, while climate benefits are distribution-neutral orJournal of Environmental Economics and Management 127 (2024) 103012\n10M. Gilli et al.\nFig. 5. Between and within-country damage incidence by 2100 under SSP3-RCP7.0. All three plots show demeaned income and impact values, panel A by\ncountry-year, panel B by year showing aggregated GDP and impact values, and panel C by year showing decile-based values. Damages (in red) and Benefits\n(in blue) are shown separately. Solid lines show the mean estimated relationship based on the estimated income elasticities throughout the time horizon. (For\ninterpretation of the references to color in this figure legend, the reader is referred to the web version of this article.)\nslightly progressive. All the results underline the importance of considering not only differentiated climate effects between countries,\nas well-established in the literature, but also within. The present paper represents a first attempt at doing this.\nSeveral caveats and additional research directions remain, based on these results. First, in this paper, we analyzed the\ndistributional consequences of impacts from temperature only. It does not follow that future impacts from other dimensions of the\nclimate – such as rainfall, humidity, and extreme weather events – will necessarily have the same consequences on the distribution\nof income within countries. Similarly, damages that have been limited or have not occurred in the past ( e.g., sea level rise, ecosystem\ntipping points) are not factored in our analysis and may have uneven consequences along the income distribution within and between\ncountries. Secondly, concerning inequality, dimensions other than income or consumption would be essential to identify impacts\nfor different socioeconomic subgroups. Third, country-level data assumes a homogeneous spatial distribution of the income deciles\nwithin a country. A more spatially fine-grained analysis, for instance, at the sub-national level, would be relevant to address this\nsimplification and to identify spatial hot spots. Finally, capturing adaptation through average income levels representing private\nand public adaptive capacity, is a simple proxy, and including more specific adaptive capacity indices or variables could provide a\nbetter measure of actual adaptive capacity and their effect on residual climate impacts.\nCRediT authorship contribution statement\nMartino Gilli: Writing – review & editing, Writing – original draft, Visualization, Software,",
    "Methodology": "",
    "Results": "show that the distributional consequences of climate impacts are regressive within countries, consistently for all three\ndamage function specifications (although the choice of damage function strongly influences global projected impacts). Specifically,\nthe poorest individuals within countries (those in the first decile of the income distribution) are projected to suffer the most severe\neconomic impacts of climate change. Additionally, the vulnerability to rising temperatures decreases almost monotonically across\nincome deciles within countries. Moreover, in line with the existing literature, the majority of climate damages is concentrated in the\nhotter and poorer regions of the world: those most affected by climate change are the poorest between andwithin countries . Allowing\nfor income-based adaptation, population-weighted within-country variation of climate damages accounts for almost two-thirds of\nthe variance of total damages by 2100, with the remaining variation explained by variation in damages across countries.\nThe global within-country income elasticity of damages and benefits is a summary statistic providing a simple quantification\nof the distributional implications of climate impacts. It can be used as input for other assessments, e.g., for the Social Cost of\nCarbon (Dennig et al., 2015). This value is estimated with an extensive Monte Carlo analysis, resulting in a central value of 0.64\nand a 25/75% confidence range of [0.5;0.8] for the elasticity of damages, and a central value of 1.01 [0.8;1.2] for the elasticity\nof benefits. Climate change damages are more regressively distributed in poorer and warmer countries, while benefits are captured\nslightly more by the richer deciles in advanced economies.\nThe article is organized as follows. Section 2 presents the empirical strategy estimating the impact functions by income decile.\nAfter describing the data in Section 3, Section 4 presents the results. The following sections discuss the projected damages until\n2100 (Section 5) and the income elasticity of climate impacts (Section 6), followed by the conclusions in Section 7.\n2. Empirical strategy\nThe empirical strategy employs three different impact functions from the climate econometrics literature to study the effect of\nweather variables (annual temperature and precipitation) on the growth of income across income deciles within countries. Given the\nexisting uncertainty regarding the most appropriate specification and the importance for climate damage projections, as highlighted\nin Newell et al. (2021), we consider multiple impact functions specification. These three impact functions build on Burke et al.\n(2015), Kalkuhl and Wenz (2020) and Jiao et al. (2023), respectively. We estimate them separately for each decile 𝑞= 1,…,10of\nthe (within-country) net income distribution. We model the income growth of each decile as a function of annual mean temperature,\ncumulative yearly precipitation, and other covariates, which include the usual fixed effects by country and year, as well as country-\nspecific trends. We further include among the covariates one lag of the dependent variable, as in Pretis et al. (2018), to better\naccount for the dynamics of income by decile and better isolate the effects of temperature. Note that with the large time dimension\nin our data ( 𝑇≈ 55), the bias on the lagged dependent variable coefficient in fixed effect models becomes negligible.\nThe impact function from Burke et al. (2015) (henceforth BHM) allows for a non-linear relation between temperature and output\ngrowth through the use of quadratic terms so that a marginal increase in temperature may have a differential effect in countries\nwith different climates. At the same time, this specification implicitly assumes that countries’ response to temperature changes only\ndepends on their initial temperature levels and not on other factors. Formally:\n𝛥𝑦𝑞\n𝑖𝑡=𝛥𝑦𝑞\n𝑖𝑡−1+𝛽𝑞\n1𝑇𝑒𝑚𝑝𝑖𝑡+𝛽𝑞\n2𝑇𝑒𝑚𝑝2\n𝑖𝑡+𝛾𝑞\n1𝑃𝑟𝑒𝑐𝑖𝑡+𝛾𝑞\n2𝑃𝑟𝑒𝑐2\n𝑖𝑡+𝛼𝑖+𝜃𝑡+𝜁𝑖𝑡+𝜁𝑖𝑡2+𝜖𝑖𝑡 (1)\n1We estimate the impact functions of Burke et al. (2015), Kalkuhl and Wenz (2020), and Jiao et al. (2023), as detailed below.Journal of Environmental Economics and Management 127 (2024) 103012\n3M. Gilli et al.\nwith𝑖and𝑡indexing country and year, respectively. 𝑦𝑖𝑡is the real per capita income of decile 𝑞in logarithm. 𝛥is the first-difference\noperator,𝑇𝑒𝑚𝑝𝑖𝑡is the annual average temperature, and 𝑃𝑟𝑒𝑐𝑖𝑡is annual cumulative precipitation,2𝛼𝑖and𝜃𝑡are country- and\nyear-fixed effects, 𝜁𝑖𝑡and𝜁𝑖𝑡2are linear and quadratic country-specific time trends.\nThe impact function from Kalkuhl and Wenz (2020)3(henceforth KW) for the decile 𝑞is:\n𝛥𝑦𝑞\n𝑖𝑡=𝛥𝑦𝑞\n𝑖𝑡−1+𝛽𝑞\n0𝛥𝑇𝑒𝑚𝑝𝑖𝑡+𝛽𝑞\n1𝛥𝑇𝑒𝑚𝑝𝑖𝑡−1+𝛽𝑞\n2𝛥𝑇𝑒𝑚𝑝𝑖𝑡∗𝑇𝑒𝑚𝑝𝑖𝑡−1+𝛽𝑞\n3𝛥𝑇𝑒𝑚𝑝𝑖𝑡−1∗𝑇𝑒𝑚𝑝𝑖𝑡−1\n+𝜆𝑞\n0𝛥𝑃𝑟𝑒𝑐𝑖𝑡+𝜆𝑞\n1𝛥𝑃𝑟𝑒𝑐𝑖𝑡−1+𝜆𝑞\n2𝛥𝑃𝑟𝑒𝑐𝑖𝑡∗𝑃𝑟𝑒𝑐𝑖𝑡−1+𝜆𝑞\n3𝛥𝑃𝑟𝑒𝑐𝑖𝑡−1∗𝑃𝑟𝑒𝑐𝑖𝑡−1\n+𝜙𝑞\n1𝑃𝑟𝑒𝑐𝑖𝑡−1+𝜙𝑞\n2𝑃𝑟𝑒𝑐2\n𝑖𝑡−1+𝜁𝑞\n1𝑇𝑒𝑚𝑝𝑖𝑡−1+𝜁𝑞\n2𝑇𝑒𝑚𝑝2\n𝑖𝑡−1+𝛼𝑖+𝜃𝑡+𝛿𝑖𝑡+𝜖𝑖𝑡 (2)\nAs in BHM, this modeling choice allows for heterogeneous impacts of temperature shocks across different climates without\nadditional forms of heterogeneity. Moreover, it allows weather variables to have both a level effect on aggregate output from the\nterms in first difference (i.e. a temporary effect on the growth rate of output) and a growth effect from the terms in levels (i.e. a\npermanent effect on the growth rate of output).\nNext, we consider the possibility that income alters the responsiveness of growth to the local climate, as in Jiao et al. (2023).4\nBy observing damages from temperature shocks, we can infer that adaptation to climate shocks is costly. Higher income relaxes\nthe budget constraint under which economic agents undertake the optimal adaptation decision. Hence, the wealthier an agent is,\nthe more they can invest in adaptation to insulate themselves from climate impacts. This simple theoretical hypothesis guides the\nempirical specification of the impact function, which allows for income-driven adaptation. In an extension of Burke et al. (2015), we\ninteract each term of the quadratic functions of temperature and precipitations with 𝑦𝑖𝑡−1, the lagged country-level log of GDP per\ncapita of country 𝑖. This can capture private adaptive capacity, allowing investment into proactive or reactive adaptation measures,\nbut also public adaptation measures. We refer to this model specification as BHM-Adaptation. This is our preferred specification\nand the one we focus on when presenting our main results in Sections 4 and 5, while showing that the main takeaways regarding\nthe distributional consequences of projected climate impacts are robust to the choice of the damage function.\n𝛥𝑦𝑞\n𝑖𝑡=𝛥𝑦𝑞\n𝑖𝑡−1+𝑇𝑒𝑚𝑝𝑖𝑡(𝛽𝑞\n1+𝛽𝑞\n3𝑦𝑖𝑡−1) +𝑇𝑒𝑚𝑝2\n𝑖𝑡(𝛽𝑞\n2+𝛽𝑞\n4𝑦𝑖𝑡−1) +𝑃𝑟𝑒𝑐𝑖𝑡(𝛾𝑞\n1+𝛾𝑞\n3𝑦𝑖𝑡−1) (3)\n+𝑃𝑟𝑒𝑐2\n𝑖𝑡(𝛾𝑞\n2+𝛾𝑞\n4𝑦𝑖𝑡−1) +𝛼𝑖+𝜆𝑡+𝛿𝑖𝑡+𝜖𝑖𝑡\nThe hypothesis is that income mitigates damages caused by deviations from the optimal temperature, and we expect that 𝛽3\nand𝛽4have opposite signs to 𝛽1and𝛽2, respectively. Given that GDP per capita is always positive, the higher a country’s average\nincome is, the flatter its temperature response function will be, and vice versa.\nHence, this reduced-form specification can capture, for example, the kind of adaptation that takes place by re-allocating\nproduction to sectors less exposed to the higher temperature’s negative impacts on productivity (see e.g.Somanathan et al. (2021)),\nor by investing in protective technologies such as air conditioning (Barreca et al., 2015). This extension of the polynomial damage\nfunction specification allowing for income-driven adaptation follows (Carleton et al., 2022), who apply a similar strategy to the\nmortality impacts of daily temperatures.5Jiao et al. (2023) show how outlier observations in the dependent variable of interest can\ndistort OLS coefficients because some identifying variation in the dependent variable may be erroneously attributed to variation\nin the climate variables of interest, thus biasing the coefficients on those variables, despite the presence of fixed effects and other\ncontrols. Because of this, we present in Section A.1 results for the decile-level BHM-adaptation damage function estimated with OLS\ndropping the top and bottom 1% of outliers, as well as using the Impulse Indicator Saturation (IIS) estimator proposed in Santos\net al. (2008). The sign and size of the coefficients are robust, but come at a cost in precision, especially for the lower deciles, leading\nus to rely on the full-sample results when presenting the projected distributional consequences of climate impacts.\nIn addition to the decile-level damage functions, we estimate the country-level corresponding functions, with the same\nexplanatory variables and where the dependent variable is 𝛥𝑦𝑖𝑡, the growth of real per capita GDP in country 𝑖and year𝑡.\nTo summarize, we estimate a separate set of coefficients for each income decile. We evaluate how the ten deciles of net income\ndistribution respond to the same country-level variations in annual temperature. The distributional consequences of climate change\nwithin each country will then depend on the relative slopes of the impact function among each decile. Income inequality will worsen\ndue to climate change if the impact functions for lower deciles, evaluated at the country’s current climate, have a steeper negative\nslope than the upper deciles of the income distribution, and vice versa. When presenting our decile-level results on the impact\nof temperatures on decile income growth in Sections 4 and 5, we focus especially on the findings from the estimation of Eq. (3).\nIn Section 6 we show that our main findings on the distribution of climate impacts within countries hold across all three impact\nfunction specifications from the literature.\n2Whereas Kotz et al. (2022) also include extreme indices of climate in the framework of Kalkuhl and Wenz (2020), their results suggest that the largest part\nof impacts can indeed be captured by annual mean temperature. Hence we focus on these aggregate values here.\n3We consider column (5) from Table 4 in Kalkuhl and Wenz (2020), as this is indicated as the preferred panel specification in the paper and the one used\nfor climate impact projections\n4A similar specification is also examined in Burke et al. (2015), Extended Data figure 1, but with an interaction for the linear temperature term only.\n5We show in Section A.1 that our results are robust to considering the average per capita GDP over the sample period, a rolling average of 10 or 15 years\nfor̄ 𝑦𝑖, as well as to excluding precipitation controls or allowing for quadratic trends.Journal of Environmental Economics and Management 127 (2024) 103012\n4M. Gilli et al.\nTable 1\nSummary statistics.\nName Mean Min Max SD\n1 Log(GDP pc) 8.20 5.11 11.63 1.43\n2 GDP pc growth 0.02 −1.03 0.68 0.06\n3 1st decile, share in % 2.21 0.00 5.36 0.98\n4 2nd decile 3.66 0.18 7.21 1.30\n5 3rd decile 4.67 0.21 8.07 1.40\n6 4th decile 5.66 0.56 8.96 1.42\n7 5th decile 6.71 1.58 9.82 1.38\n8 6th decile 7.92 2.44 10.78 1.29\n9 7th decile 9.47 4.05 12.50 1.11\n10 8th decile 11.66 6.17 14.64 0.83\n11 9th decile 15.41 10.85 19.49 0.86\n12 10th decile 32.70 13.74 70.95 8.89\n13 Annual temperature (◦C) 18.02 −3.47 29.98 7.68\n14 Annual precipitation (mm) 91.22 0.83 356.52 55.93\n3. Data\nTemperature and precipitation data come from the Climate Research Unit at the University of East Anglia. We aggregate gridded\nmonthly average temperature and precipitation with 0.5◦resolution using population weights at the same resolution from the\nSocioEconomic Data and Applications Center (SEDAC) at Columbia University, accounting for cells that are only partially covered\nby a country’s borders and for the area extent of each pixel. This is done computing the weights 𝑤for each grid cell belonging to\na country according to the formula 𝑤𝑗,𝑖=𝑐𝑗,𝑖∗𝑎𝑗,𝑖∗𝑝𝑗,𝑖, where𝑐𝑖is the fraction of the cell 𝑗that falls within country 𝑖’s borders,\n𝑎𝑗,𝑖is the area in km covered by the grid-cell (this changes across latitudes) and 𝑝𝑗,𝑖is the population count/km in the cell. The\nmonthly series are then aggregated to the annual level in order to match the macroeconomic indicators.\nGDP growth data comes from World Bank’s Development Indicators, calculated from GDP per capita in constant 2015 USD.\nDecile-level income is reconstructed from decile-level income shares data described and assembled in Narayan et al. (2023b) and\nslightly updated in Narayan et al. (2023a). The authors combine publicly available data on the deciles of the within-country\ndistribution of net income (post-tax, disposable) from the UNU Wider World Income Inequality Database (WIID), with data on\ndeciles for consumption, and country-level Gini data from the World Bank’s World Development Indicators. Briefly, they impute the\nmissing values for income deciles with the predicted values coming from (i) consumption data when available (predicted through\nOLS), and (ii) Gini data through Principal Component Analysis. This yields an almost balanced panel dataset, in contrast to a strongly\nunbalanced WIID. We compute decile-level income levels multiplying decile-level income share by GDP per capita. The analysis is\nperformed on unbalanced data (because of missing Gini or GDP data) from 1960 to 2015. Table 1 presents the summary statistics\nof the variables we use for our empirical specifications.\nProjections follow the combined Shared Socioeconomic Pathways (SSPs) for country-level socioeconomic variables (Population\nand GDP) (Riahi et al., 2017). We use as a reference the SSP3 scenario, which follows current trends in regional rivalries and\nconflicts, assuming reversal in globalization trends (O’Neill et al., 2017). SSP2 is explored as a robustness check (see Section A.5). We\ncompare this scenario without climate impacts to the same projected per-capita GDP after applying climate impacts from temperature\nincreases. The impacts are based on the damage coefficients estimated in Section 4. Since the regression coefficients for precipitation\nare imprecisely estimated and its future projections are not reliable, we focus our analysis on the effects of temperature, in line with\nthe existing literature.\nTo create our baseline scenario under SSP3 with no climate impacts, we use the RICE50+ model, described in detail in Gazzotti\n(2022). The model is an extension of Nordhaus’s seminal DICE model (Nordhaus, 2017) and features 154 countries. Temperature is\ndownscaled to the country level based on the CMIP6 model ensemble (Eyring et al., 2016). The model includes projections for total\nGDP and population at the country level as well as projections on decile-level income, depending on the SSP scenario. The main\nscenario we consider when presenting our results sees GDP growing under the SSP3 scenario, thus yielding temperatures similar to\nthe high-emission RCP 7.0 scenario. Indeed, the global average increase in surface temperature is around 3.6◦Cby 2100 under this\nscenario relative to preindustrial (Appendix Figure A.5).\n4. Empirical results\nEstimates from Eq. (3) (BHM-Adaptation) confirm that country-level income plays a crucial role in reducing vulnerability to\nclimate damages. In addition, the poorer deciles are more affected by climate, furthering within-country inequalities. The estimated\ncoefficients are presented in Table 2.\nNotably, two key factors contribute to larger damages in lower-income countries. First, the damage function of lower-income\ncountries exhibits a steeper curve. This implies that marginal damages grow faster in poorer countries as temperatures deviate\nfrom the optimal level in a warming world. An inverted-U damage function, consistently with previous studies (e.g., Burke et al.\n(2015)), becomes less pronounced as GDP increases. This reduced sensitivity of economic growth between countries results fromJournal of Environmental Economics and Management 127 (2024) 103012\n5M. Gilli et al.\nTable 2\nDamage functions, with BHM-adaptation.\nDependent variables: Decile income growth GDP pc growth\nModel: (1) (2) (3) (4) (5) (6) (7) (8) (9) (10) (11)\nVariables\nTemperature 0.1657∗∗∗0.1390∗∗∗0.1375∗∗∗0.1356∗∗∗0.1304∗∗∗0.1281∗∗∗0.1275∗∗∗0.1288∗∗∗0.1278∗∗∗0.1180∗∗∗0.1329∗∗∗\n(0.0621) (0.0399) (0.0352) (0.0317) (0.0287) (0.0268) (0.0252) (0.0238) (0.0227) (0.0237) (0.0237)\nTemperature, Squared −0.0045∗∗−0.0032∗∗−0.0033∗∗∗−0.0033∗∗∗−0.0032∗∗∗−0.0031∗∗∗−0.0031∗∗∗−0.0031∗∗∗−0.0031∗∗∗−0.0028∗∗∗−0.0032∗∗∗\n(0.0021) (0.0014) (0.0012) (0.0011) (0.0009) (0.0009) (0.0008) (0.0008) (0.0007) (0.0008) (0.0008)\nTemperature ×GDP(𝑡− 1) −0.0152∗∗−0.0124∗∗∗−0.0126∗∗∗−0.0124∗∗∗−0.0122∗∗∗−0.0120∗∗∗−0.0120∗∗∗−0.0122∗∗∗−0.0121∗∗∗−0.0107∗∗∗−0.0126∗∗∗\n(0.0063) (0.0040) (0.0036) (0.0032) (0.0030) (0.0028) (0.0026) (0.0025) (0.0024) (0.0026) (0.0025)\nTemperature Sq. ×GDP(𝑡− 1) 0.0004∗0.0003∗0.0003∗∗0.0003∗∗0.0003∗∗∗0.0003∗∗∗0.0003∗∗∗0.0003∗∗∗0.0003∗∗∗0.0003∗∗∗0.0003∗∗∗\n(0.0002) (0.0002) (0.0001) (0.0001) (0.0001) (0.0001) ( 9.43 × 10−5) ( 8.9 × 10−5) ( 8.59 × 10−5) ( 9.57 × 10−5) ( 8.81 × 10−5)\nFixed-effects\nCountry Yes Yes Yes Yes Yes Yes Yes Yes Yes Yes Yes\nYear Yes Yes Yes Yes Yes Yes Yes Yes Yes Yes Yes\nVarying Slopes\nYear (Country) Yes Yes Yes Yes Yes Yes Yes Yes Yes Yes Yes\nFit statistics\nObservations 5,551 5,551 5,551 5,551 5,551 5,551 5,551 5,551 5,551 5,551 5,551\nR20.09430 0.09704 0.10928 0.13340 0.16973 0.20311 0.24298 0.27602 0.27332 0.14926 0.30600\nWithin R20.06357 0.02177 0.02327 0.03068 0.03692 0.04902 0.06888 0.08896 0.08365 0.04845 0.11574\nClustered (Country) standard-errors in parentheses .\nSignif. Codes: ***: 0.01, **: 0.05, *: 0.1 .\nNote: Regressions of decile income growth (columns 1 through 10) and GDP per capita growth (column 11) on a function of temperature and income. All regressions also include precipitation, squared precipitation, and their\ninteraction with lagged income levels.\nthe interaction terms of lagged income with linear and quadratic temperature, with these terms exhibiting opposite signs of the non-\ninteracted temperature terms for all deciles. To illustrate this, Fig. 1 displays the decile-level and country-level damage functions at\nvarious income levels for a hypothetical low-income country (25th percentile of per capita GDP observations in the sample, 1300\nUSD), a middle-income country (50th percentile, 3463 USD), and a high-income country (75th percentile, 12968 USD). Confidence\nintervals are excluded in the figure for visual clarity, and they are reported in Figure A.2 in the Appendix. Results do not appear to\nbe artifacts of the reconstruction of income shares in Narayan et al. (2023a) (Section A.1 in Appendix).\nSecond, current temperatures are already further above the optimal temperature in poorer countries than they are in richer ones.\nThe optimal temperature estimated from the decile-level regressions across income levels of countries is around 18◦C (although it\nvaries slightly across deciles), higher than the optimal levels of Burke et al. (2015) (13◦C) and Kalkuhl and Wenz (2020) (5◦C). Low-\nincome countries are on average warmer meaning that, assuming a quadratic damage functions, a marginal increase in temperatures\nleads to proportionally larger losses in output growth.\nThe impacts are also unequal within countries. As plotted in Fig. 1 and implied by the coefficients of Table 2, the damage\nfunctions show that the income of poorer households is more responsive to temperature changes regardless of GDP levels. In addition\nto this, we also see that the responsiveness to temperature appears to decrease almost monotonically across income deciles.\nTo summarize, the sensitivity of income to climate decreases along the income distribution both between and within countries.\nThe within variation is the key result underpinning Sections 5 and 6 on the distributional consequences of climate change impacts.\n5. Projected distributional impacts\nThe previous section highlighted the distributional effects of climate change estimated over the past half-century, within and\nbetween countries. However, it remains unclear what the future distributional implications will be. On the one hand, increasing\ntemperatures will damage GDP growth; on the other hand, higher income levels will increase adaptive capacity. We, therefore,\nproject damages to the end of the century and explore the distributional implications within and between countries.\nWe project GDP and temperature using the RICE50+ model (Gazzotti, 2022). Decile-level income is reconstructed from projected\ndecile shares (Narayan et al., 2023b) and GDP. Impacts for each decile 𝑞in time𝑡are then defined as the difference between the\nprojected income per capita 𝑦𝑞\n𝑖𝑡with climate impacts and counterfactual income per capita ̃ 𝑦𝑞\n𝑖𝑡without impacts6:\n𝑑𝑞\n𝑖𝑡=̃ 𝑦𝑞\n𝑖𝑡−𝑦𝑞\n𝑖𝑡. (4)\nThe counterfactual ̃ 𝑦𝑞\n𝑖𝑡is constructed letting income of decile 𝑞in year𝑡and country 𝑖evolve according to:\ñ 𝑦𝑞\n𝑖𝑡= (1 +𝑔𝑞\n𝑖𝑡)̃ 𝑦𝑞\n𝑖𝑡−1(5)\nwhere𝑔is the counterfactual growth rate under no climate impacts from the SSPs. Income with climate impacts is\n𝑦𝑞\n𝑖𝑡= (1 +𝑔𝑞\n𝑖𝑡+𝛿𝑞\n𝑖𝑡)𝑦𝑞\n𝑖𝑡−1(6)\nwith𝛿𝑞\n𝑖𝑡is the estimated climate impact factor, which differs across impact function specifications. It represents the reduction or\nincrease in economic growth rate caused by deviations from the optimal temperature. Under the BHM specification, 𝛿𝑞\n𝑖𝑡is:\n𝛿𝑞,𝐵𝐻𝑀\n𝑖𝑡=̂𝛽1𝑞(𝑇𝑒𝑚𝑝𝑖𝑡−𝑇𝑒𝑚𝑝𝑖0) +̂𝛽2𝑞(𝑇𝑒𝑚𝑝2\n𝑖𝑡−𝑇𝑒𝑚𝑝2\n𝑖0) (7)\n6Analogously, country-level damages are defined as∑\n𝑞𝑑𝑞\n𝑖𝑡=∑\n𝑞(̃ 𝑦𝑞\n𝑖𝑡−𝑦𝑞\n𝑖𝑡).Journal of Environmental Economics and Management 127 (2024) 103012\n6M. Gilli et al.\nFig. 1. Damage functions at the decile level. D1toD10 indicate deciles from the poorest to the richest. GDP indicates the country-level damage functions.\nDecile-level damage functions with income-driven adaptation for three selected countries at different income levels. The shape of the function varies with the\nincome level both within and between countries. Confidence intervals have been omitted for visual clarity; they are reported in Figure A.2 in the Appendix. Low\nincome : 25th percentile of the GDP per capita distribution in the sample, 1,300 USD per capita. Middle income : 50th percentile, 3,463 USD. High income : 75th\npercentile, 12,968 USD.\nUnder the KW specification, it is:\n𝛿𝑞,𝐾𝑊\n𝑖𝑡=̂𝛽0𝑞𝛥𝑇𝑒𝑚𝑝𝑖𝑡+̂𝛽1𝑞𝛥𝑇𝑒𝑚𝑝𝑖𝑡−1+̂𝛽2𝑞𝛥𝑇𝑒𝑚𝑝𝑖𝑡∗𝑇𝑒𝑚𝑝𝑖𝑡−1+̂𝛽3𝑞𝛥𝑇𝑒𝑚𝑝𝑖𝑡−1∗𝑇𝑒𝑚𝑝𝑖𝑡−1 (8)\nUnder the BHM-Adaptation specification, it is:\n𝛿𝑞,𝐵𝐻𝑀 −𝐴𝑑𝑎𝑝𝑡𝑎𝑡𝑖𝑜𝑛\n𝑖𝑡= (𝑇𝑒𝑚𝑝𝑖𝑡−𝑇𝑒𝑚𝑝𝑖0)(̂𝛽𝑞\n1+̂𝛽𝑞\n3𝑦𝑖𝑡−1) + (𝑇𝑒𝑚𝑝2\n𝑖𝑡−𝑇𝑒𝑚𝑝2\n𝑖0)(̂𝛽𝑞\n2+̂𝛽𝑞\n4𝑦𝑖𝑡−1) (9)\nwhere𝑇𝑒𝑚𝑝𝑖0is temperature in country 𝑖in 2015 and 𝑦𝑖𝑡−1is the lagged GDP per capita under climate impacts in logarithms. Note\nthe compounding of effects: climate change may reduce income levels and thus the ability to adapt, causing larger relative damages.\nThe projected impacts across damage functions are of the same order of magnitude. In 2100, under a RCP 7.0 warming scenario,\nglobal impacts on per capita GDP are projected at around 9% of GDP under the BHM specification, 7.5% under the BHM-Adaptation\nspecification and about 2.4% of GDP under the KW specification (when estimated with country-level data instead of the original\nsub-national level data).7We report the estimated global impacts over time for all damage function specifications, as implied by our\nempirical results, in Figure A.6 in Section A.6, where we also explain some discrepancies with previous results on global projected\nimpacts.\nDistributional effects are shown by Fig. 2 , which displays projected climate impacts as a share of income across income deciles\nunder the BHM-Adaptation specification. Median impacts are negative and similar for all deciles but the richest one. However, the\nimpacts range and variance across countries is larger for the lower deciles. The negative and regressive effect of climate change is\nconsistent across the three damage functions (Figures A.8 and A.9 in Appendix).\nGlobally, climate impacts are more regressive in hotter and poorer countries. Fig. 3 displays how the projected regressive damages\nvary across countries. Panel (a) plots the difference between the relative impacts (impacts as a share of income) of the lowest and\nthe highest decile. Hence, a higher value implies that poorer strata are more exposed to climate impacts.8In other words, the more\nstrongly regressive consequences will come in the currently hotter and poorer parts of the world, as implied by Fig. 1. The impact\ngap between the top and bottom decile is especially marked in Sub-Saharan Africa, the Middle East, South Asia, as well as parts of\nLatin America.\nFig. 3b displays the consequences for the Gini index by country of our projected decile-level climate impacts under the SSP3\nscenario, implying warming of +3.6◦C by 2100. Consistently with the findings in panel (a), higher starting temperatures are\nprojected to increase within-country inequality, as measured by the Gini index, for basically every country in the world. The stronger\nnegative consequences for an equal distribution of income within countries are again projected to be seen in Sub-Saharan Africa\nand the Middle East, with a projected increase of up to 6 points in the index. This is broadly consistent with the previous findings\nin Malpede and Percoco (2021 ), Paglialunga et al. (2022 ) and Cevik and Jalles (2023 ), despite the different econometric models\nused.\n7In Figure A.11 in Section A.8, we display projected damages across four SSP-RCP scenarios for all three damage functions.\n8in Figure A.7 in Section A.7 we display projected damages in 2100 to per capita income for all deciles in all countries, for completenessJournal of Environmental Economics and Management 127 (2024) 103012\n7M. Gilli et al.\nFig. 2. Projected decile-level impacts in 2100 under SSP3 scenario, with a climate sensitivity equal to 1. Each dot represents the projected impact on decile-level\nincome for a given income decile in one of the 154 countries of RICE50+. Dot placement is slightly perturbed for visualization purposes. Horizontal orange lines\nmark the medians of the distribution, for each decile, of projected impacts across regions. (For interpretation of the references to color in this figure legend, the\nreader is referred to the web version of this article.)\nFig. 3. Distributional effects of climate damages by 2100 under SSP3 and BHM-Adapt damages. Panel (a): differences in damages as a share of income between\nD1 and D10. Panel (b): impact of climate change on the Gini index.\nTherefore, climate change is estimated to have adverse distributional consequences in the future, globally worsening within-\ncountry inequality across the century. The next section estimates the income elasticity of climate impacts to provide a summary\nmeasure for this effect.\n6. The income elasticity of climate impacts\nThe income elasticity of climate impacts – how responsive relative damages are to a change in income along the within-country\nincome distribution – has important implications for poverty, for political economy considerations, and, ultimately, for the socially\noptimal climate policy and the Social Cost of Carbon ( Dennig et al. , 2015 ). The income elasticity 𝜉is defined by the relationship\n𝑑𝑞\n𝑖𝑡∝(̃ 𝑦𝑞\n𝑖𝑡)𝜉. (10)\nImpacts are proportional to income ( i.e.,distribution-neutral) if 𝜉= 1, and fall disproportionately on the poor when 𝜉 <1and\non the rich when 𝜉>1.\nWe estimate the within-country income elasticity of climate impacts until 2100 using a standard log–log regression of decile-based\nimpacts on per capita income level ( Eqs. (11) and (12)). We use a fixed effects model, whereby we include a full set of country-year\nfixed effects. This allows us to identify the elasticity relying on variation within a country-year combination.\nSome countries and deciles could experience benefits from higher temperatures if their climates start from a temperature to the\nleft of the estimated optimal temperature. Therefore, climate impacts can be both positive (i.e. benefits) or negative (i.e. damages).Journal of Environmental Economics and Management 127 (2024) 103012\n8M. Gilli et al.\nTable 3\nIncome elasticity of climate impacts.\nDamages Benefits\nBHM-Adapt BHM KW BHM-Adapt BHM KW\nMean estimate 0.64 0.76 0.60 1.01 1.15 1.13\nFull uncertainty IQR [0.51, 0.75] [0.63, 0.83] [0.53, 0.61] [0.78, 1.21] [0.86, 1.34] [0.91, 1.29]\nFull uncertainty 95% range [0.37, 1.11] [0.51, 1.43] [0.45, 1.18] [0.46, 1.73] [0.64, 2.22] [0.72, 1.9]\nEconometric uncertainty 𝜎 0.22 0.26 0.17 0.32 0.44 0.29\nClimate uncertainty 𝜎 0.07 0.07 0.03 0.26 0.19 0.18\nFull uncertainty 𝜎 0.20 0.22 0.16 0.34 0.40 0.30\nWithin-country income elasticity of climate impacts under SSP3 from the Monte Carlo analysis. Temperature is projected, drawing 500 climate sensitivities\nfrom a𝐿𝑜𝑔𝑛𝑜𝑟𝑚𝑎𝑙 (1.1,0.3), while 500 damage function parameters are drawn from empirical multivariate normal distributions characterized by the covariance\nestimated in Section 4. Mean estimate are averages across all simulations, encompassing both climate model and statistical uncertainty. The Full uncertainty IQR\nandFull uncertainty 95% range indicate the interquartile range (IQR) and the 95% coverage range across all simulations, encompassing both climate model and\nstatistical uncertainty. The Econometric uncertainty 𝜎indicates the standard deviation of the within-country income elasticity of climate impacts across Monte\nCarlo simulations in which the climate sensitivity is fixed at 3. The Climate uncertainty 𝜎indicates the standard deviation of the within-country income elasticity\nof climate impacts across Monte Carlo simulations in which damage function parameters are fixed at point estimates. The Full uncertainty 𝜎is the uncertainty\nfrom the full set of Monte Carlo results.\nTo estimate a meaningful income elasticity, we split the data and separately estimate the income elasticity of damages ( 𝜉−) and the\nincome elasticity of benefits ( 𝜉+) according to:\n𝑙𝑛(-𝑑𝑞−\n𝑖𝑡)=𝛼−\n𝑖+𝜉−𝑙𝑛(̃𝑦𝑞\n𝑖𝑡)+𝜙−\n𝑖𝑡+𝜖𝑞−\n𝑖𝑡(11)\n𝑙𝑛(𝑑𝑞+\n𝑖𝑡)=𝛼+\n𝑖+𝜉+𝑙𝑛(̃𝑦𝑞\n𝑖𝑡)+𝜙+\n𝑖𝑡+𝜖𝑞+\n𝑖𝑡(12)\nHere,𝑑𝑞−are climate damages and 𝑑𝑞+are climate benefits, 𝜙⋅\n𝑖𝑡denotes a set of country-year fixed effects and 𝜖𝑞⋅\n𝑖𝑡a random error\nterm.\nBoth elasticities imply progressivity of impacts for values greater than 1 and regressivity for values smaller than 1. It should\nbe noted, however, that 𝜉+>1is progressive from a mathematical perspective, but otherwise socially regressive: benefits are\ndisproportionately enjoyed by the wealthier deciles.9\nTo better characterize the evolution of climate impacts, we explore the climate model and econometric uncertainty with a Monte\nCarlo simulation. To explore climate uncertainty, we simulate climate trajectories under different equilibrium climate sensitivities\n(ECS). We draw 500 climate sensitivities from a 𝐿𝑜𝑔𝑛𝑜𝑟𝑚𝑎𝑙 (1.1,0.3), which has a 66% (17%–83%) range for sensitivity of 2.2-3.9\nK per doubling of atmospheric carbon dioxide, in line with the current understanding of the ECS (Sherwood et al., 2020). Given\nthe climate sensitivity, we reconstruct a global temperature projection using the climate module within RICE50+ (Figure A.5). The\nRICE50+ climate module is a three-layer carbon and two-layer temperature model, adjusted in its exchange coefficients to match\nthe MAGICC6 model emulation (Meinshausen et al., 2011). The econometric uncertainty is derived drawing at random 500 values\nfrom a multivariate normal distribution with the covariance estimated in Section 4. Finally, for each specification (drawn from the\nparameter space) and temperature projection, we reconstruct the evolution of income with impacts 𝑦𝑞\n𝑖𝑡and𝑑𝑞\n𝑖𝑡. That is, we compute\n250,000 elasticities for each damage function and for each SSP scenario. Results for SSP2 are similar and shown in the Appendix.\nFig. 4 shows the distribution of within-country income elasticities, and Table 3 provides summary statistics. While global\nprojected damages are sensitive to the choice of the damage function as shown in Newell et al. (2021) and in Figure A.6, the\nincome elasticity of climate impacts is consistent across the three specifications. The damages from climate change are projected to\nbe disproportionately borne by poorer deciles. The mean income elasticity of damages is estimated at 0.64 under BHM-Adaptation,\n0.76 under the BHM specification, and 0.60 under the KW specification, with the 75th percentile of the distribution substantially\nbelow 1 for all specifications. The income elasticity of climate benefits has a comparatively wider distribution, the central estimate\nof which is close to distribution neutrality. The mean estimate of 𝜉+is 1.01 for BHM-Adaptation, 1.15 for BHM, and 1.13 for KW.\nThe existing literature offers some, yet limited, comparisons. Mendelsohn et al. (2012) find an income elasticity of 0.42 for\ndamages from tropical cyclones. For some impacts, the elasticity could even be negative (Tol, 2021), while an average elasticity\nof damages of 1 (proportional damages) has also been used (Anthoff and Tol, 2012; Dietz et al., 2018). Therefore, our results fall\nwithin a range that is compatible with previous work on the topic.\nWe then explore heterogeneity in elasticities above and below median GDP in Table 4, and above and below median temperatures.\nProjections use the point estimates of Eq. (3) and temperature projections with an ECS of 3. Damages are more regressive in poorer\ncountries (those with a below-median per capita GDP, 𝜉−= 0.51) as well as in hotter countries (those with above median annual\ntemperature, 𝜉−= 0.47). Benefits are more disproportionally enjoyed by the higher deciles in richer ( 𝜉+= 1.43) and warmer\n9Dennig et al. (2015) use a slightly different definition of relative terms writing𝑑𝑞\n𝑖𝑡\n𝑑𝑖𝑡=𝑎𝑖(̃ 𝑦𝑞\n𝑖𝑡\ñ 𝑦𝑖𝑡)𝜉. While we could estimate this equation based on decile shares\nwithout fixed effects and identify within-country effects, the results are slightly different due to the non-linear transformation. In addition, the relative terms\nformulation raises questions on how to deal with climate benefits, not originally considered in Dennig et al. (2015). We thank an anonymous referee for pointing\nus to the differences between the two definitions.Journal of Environmental Economics and Management 127 (2024) 103012\n9M. Gilli et al.\nFig. 4. Distribution of the within-country income elasticity of climate impacts under SSP3 from the Monte Carlo analysis. Temperature is projected, drawing 500\nclimate sensitivities from a 𝐿𝑜𝑔𝑛𝑜𝑟𝑚𝑎𝑙 (1.1,0.3), while 500 damage function parameters are drawn from empirical multivariate normal distributions characterized\nby the covariance estimated in Section 4.Full uncertainty is the uncertainty from the full set of Monte Carlo results. Climate uncertainty is the uncertainty\nstemming from the variation in climate sensitivity. Econometric uncertainty is the uncertainty from the damage function parameters. Vertical black bars indicate\nthe average values; gray bars indicate the average values of other specifications for reference. (For interpretation of the references to color in this figure legend,\nthe reader is referred to the web version of this article.)\nTable 4\nHeterogeneity in income elasticity of climate impacts, under the BHM-Adaptation specification.\nLog(Impacts)\nDamages Benefits\n(1) (2) (3) (4) (5) (6) (7) (8)\n<median GDP >median GDP <median temp. >median temp. <median GDP >median GDP <median temp. >median temp.\nLog(Income) 0.51∗∗∗0.68∗∗∗0.87∗∗∗0.47∗∗∗1.29∗∗∗1.43∗∗∗1.37∗∗∗2.85∗∗∗\n(0.01) (0.02) (0.02) (0.01) (0.02) (0.03) (0.02) (0.10)\nCountry-Year FE Y Y Y Y Y Y Y Y\nObservations 10 413 9424 7636 12 201 2167 3156 4944 379\n𝑅20.62 0.30 0.38 0.55 0.71 0.55 0.60 0.96\nAdjusted𝑅20.62 0.30 0.38 0.55 0.71 0.55 0.60 0.96\nIncome elasticity of climate impacts using point estimates of BHM-Adaptation and standard temperature projections. HC3 standard errors in parentheses.∗𝑝 < 0.1;∗∗𝑝 < 0.05;∗∗∗𝑝 < 0.01.\n(𝜉+= 2.85) countries, although we suggest caution in the interpretation of the latter figure as only few deciles in warm countries\nexperience climate benefits.\nThe heterogeneity of climate impacts can be further unpacked, by decomposing the variance of the projected impacts at the\ndecile-country level in 2100. About 60% of the population-weighted variance of climate damages (in per capita terms) happens\nwithin countries, while the remainder happens between them. Conversely, only about a fourth of the population-weighted variance\nof climate benefits happens within countries. Fig. 5 visually explore the decomposition. The lower Panel (C) compares projected\nrelative damages𝑑𝑞\n∑\n𝑞𝑑𝑞for all decile-country observations in 2100 (that is, ten observations per country) against relative income\n𝑦𝑞\n∑\n𝑞𝑦𝑞, after removing year fixed effects. Panel (A) highlights the within-country comparison, after removing country-year fixed\neffects. Panel (B) aggregates damages and income to depict the variation in impacts across countries.\n7.",
    "Conclusion": "The results consistently show that climate change will increase within-country inequality. We first empirically investigate how\ntemperature affects decile-level income, finding that the sensitivity of income to climate decreases along the income distribution,\nboth between and within countries. We employ three different damage functions, with our preferred specification allowing for\nincome-led adaptation. Second, we project future climate impacts and find that damages fall, within countries, more heavily on\nthe poorest deciles. Third, the distributional implications of climate impacts are summarized by the income elasticities of climate\ndamages and benefits. The central estimates imply regressive climate damages, while climate benefits are distribution-neutral orJournal of Environmental Economics and Management 127 (2024) 103012\n10M. Gilli et al.\nFig. 5. Between and within-country damage incidence by 2100 under SSP3-RCP7.0. All three plots show demeaned income and impact values, panel A by\ncountry-year, panel B by year showing aggregated GDP and impact values, and panel C by year showing decile-based values. Damages (in red) and Benefits\n(in blue) are shown separately. Solid lines show the mean estimated relationship based on the estimated income elasticities throughout the time horizon. (For\ninterpretation of the references to color in this figure legend, the reader is referred to the web version of this article.)\nslightly progressive. All the results underline the importance of considering not only differentiated climate effects between countries,\nas well-established in the literature, but also within. The present paper represents a first attempt at doing this.\nSeveral caveats and additional research directions remain, based on these results. First, in this paper, we analyzed the\ndistributional consequences of impacts from temperature only. It does not follow that future impacts from other dimensions of the\nclimate – such as rainfall, humidity, and extreme weather events – will necessarily have the same consequences on the distribution\nof income within countries. Similarly, damages that have been limited or have not occurred in the past ( e.g., sea level rise, ecosystem\ntipping points) are not factored in our analysis and may have uneven consequences along the income distribution within and between\ncountries. Secondly, concerning inequality, dimensions other than income or consumption would be essential to identify impacts\nfor different socioeconomic subgroups. Third, country-level data assumes a homogeneous spatial distribution of the income deciles\nwithin a country. A more spatially fine-grained analysis, for instance, at the sub-national level, would be relevant to address this\nsimplification and to identify spatial hot spots. Finally, capturing adaptation through average income levels representing private\nand public adaptive capacity, is a simple proxy, and including more specific adaptive capacity indices or variables could provide a\nbetter measure of actual adaptive capacity and their effect on residual climate impacts.\nCRediT authorship contribution statement\nMartino Gilli: Writing – review & editing, Writing – original draft, Visualization, Software, Methodology, Investigation, Formal\nanalysis, Data curation, Conceptualization. Matteo Calcaterra: Writing – review & editing, Writing – original draft, Visualization,\nValidation, Software, Methodology, Investigation, Formal analysis, Data curation, Conceptualization. Johannes Emmerling: Writing\n– review & editing, Writing – original draft, Visualization, Validation, Supervision, Software, Methodology, Investigation, Funding\nacquisition, Formal analysis, Data curation, Conceptualization. Francesco Granella: Writing – review & editing, Writing – original\ndraft, Visualization, Validation, Software, Methodology, Investigation, Formal analysis, Data curation, Conceptualization.\nAppendix A. Supplementary data\nSupplementary material related to this article can be found online at https://doi.org/10.1016/j.jeem.2024.103012 .Journal of Environmental Economics and Management 127 (2024) 103012\n11M. Gilli et al.\nReferences\nAnthoff, David, Tol, Richard S.J., 2012. Schelling’s conjecture on climate and development: A test. In: Hahn, Robert W., Ulph, Alistair (Eds.), Climate Change\nand Common Sense: Essays in Honour of Tom Schelling. Oxford University Press, Oxford, pp. 260–274.\nBarreca, Alan, Clay, Karen, Deschênes, Olivier, Greenstone, Michael, Shapiro, Joseph S., 2015. Convergence in adaptation to climate change: Evidence from high\ntemperatures and mortality, 1900–2004. Amer. Econ. Rev. 105 (5), 247–251.\nBurke, Marshall, Hsiang, Solomon M., Miguel, Edward, 2015. Global non-linear effect of temperature on economic production. Nature 527 (7577), 235–239.\nCarleton, Tamma, Jina, Amir, Delgado, Michael, Greenstone, Michael, Houser, Trevor, Hsiang, Solomon, Hultgren, Andrew, Kopp, Robert E., McCusker, Kelly E.,\nNath, Ishan, et al., 2022. Valuing the global mortality consequences of climate change accounting for adaptation costs and benefits. Q. J. Econ. 137 (4),\n2037–2105.\nCasey, Gregory, Shayegh, Soheil, Moreno-Cruz, Juan, Bunzl, Martin, Galor, Oded, Caldeira, Ken, 2019. The impact of climate change on fertility. Environ. Res.\nLett. 14 (5), 054007.\nCattaneo, Cristina, Beine, Michel, Fröhlich, Christiane J., Kniveton, Dominic, Martinez-Zarzoso, Inmaculada, Mastrorillo, Marina, Millock, Katrin, Piguet, Etienne,\nSchraven, Benjamin, 2019. Human migration in the era of climate change. Rev. Environ. Econ. Policy 13 (2), 189–206.\nCevik, Serhan, Jalles, João Tovar, 2023. For whom the bell tolls: Climate change and income inequality. Energy Policy 174, 113475.\nCohen, François, Dechezleprêtre, Antoine, 2022. Mortality, temperature, and public health provision: evidence from Mexico. Am. Econ. J. Econ. Policy 14 (2),\n161–192.\nDasgupta, Shouro, Emmerling, Johannes, Shayegh, Soheil, 2023. Inequality and growth impacts of climate change–insights from South Africa. Environ. Res. Lett.\n18 (12), 124005.\nDe Cian, Enrica, Wing, Ian Sue, 2019. Global energy consumption in a warming climate. Environ. Resour. Econ. 72 (2), 365–410.\nde Laubier Longuet Marx, Nicolas, Espagne, Etienne, Ngo Duc, Thanh, 2019. Non-linear impacts of climate change on income and inequality in vietnam. AfD\nRep. 36.\nDell, Melissa, Jones, Benjamin F., Olken, Benjamin A., 2012. Temperature shocks and economic growth: Evidence from the last half century. Am. Econ. J.:\nMacroecon. 4 (3), 66–95.\nDennig, Francis, Budolfson, Mark B., Fleurbaey, Marc, Siebert, Asher, Socolow, Robert H., 2015. Inequality, climate impacts on the future poor, and carbon\nprices. Proc. Natl. Acad. Sci. 112 (52), 15827–15832.\nDeryugina, Tatyana, Hsiang, Solomon M., 2014. Does the Environment Still Matter? Daily Temperature and Income in the United States. Technical Report,\nNational Bureau of Economic Research.\nDeschênes, Olivier, Greenstone, Michael, 2007. The economic impacts of climate change: evidence from agricultural output and random fluctuations in weather.\nAmer. Econ. Rev. 97 (1), 354–385.\nDesmet, Klaus, Rossi-Hansberg, Esteban, 2015. On the spatial economic impact of global warming. J. Urban Econ. 88, 16–37.\nDietz, Simon, Gollier, Christian, Kessler, Louise, 2018. The climate beta. J. Environ. Econ. Manag. 87, 258–274.\nDiffenbaugh, Noah S., Burke, Marshall, 2019. Global warming has increased global economic inequality. Proc. Natl. Acad. Sci. 116 (20), 9808–9813.\nEyring, Veronika, Bony, Sandrine, Meehl, Gerald A., Senior, Catherine A., Stevens, Bjorn, Stouffer, Ronald J., Taylor, Karl E., 2016. Overview of the coupled\nmodel intercomparison project phase 6 (CMIP6) experimental design and organization. Geosci. Model Dev. 9 (5), 1937–1958.\nGazzotti, Paolo, 2022. RICE50+: DICE model at country and regional level. Soc.-Environ. Syst. Model. 4, 18038.\nGraff Zivin, Joshua, Hsiang, Solomon M., Neidell, Matthew, 2018. Temperature and human capital in the short and long run. J. Assoc. Environ. Resour. Econ.\n5 (1), 77–105.\nGraff Zivin, Joshua, Neidell, Matthew, 2014. Temperature and the allocation of time: Implications for climate change. J. Labor Econ. 32 (1), 1–26.\nHsiang, Solomon, Oliva, Paulina, Walker, Reed, 2019. The distribution of environmental damages. Rev. Environ. Econ. Policy 13 (1), 83–103.\nIsaac, Morna, Van Vuuren, Detlef P., 2009. Modeling global residential sector energy demand for heating and air conditioning in the context of climate change.\nEnergy Policy 37 (2), 507–521.\nJiao, Xiyu, Pretis, Felix, Schwarz, Moritz, 2023. Testing for coefficient distortion due to outliers with an application to the economic impacts of climate change.\nJ. Econometrics 105547.\nKalkuhl, Matthias, Wenz, Leonie, 2020. The impact of climate conditions on economic production. Evidence from a global panel of regions. J. Environ. Econ.\nManag. 103, 102360.\nKotz, Maximilian, Levermann, Anders, Wenz, Leonie, 2022. The effect of rainfall changes on economic production. Nature 601 (7892), 223–227, Number: 7892\nPublisher: Nature Publishing Group.\nLiu, Maggie, Shamdasani, Yogita, Taraz, Vis, 2023. Climate change and labor reallocation: Evidence from six decades of the Indian census. Am. Econ. J. Econ.\nPolicy 15 (2), 395–423.\nMalpede, Maurizio, Percoco, Marco, 2021. Climate Change and Income Inequalities. Technical Report, Working Paper Series.\nMeinshausen, Malte, Raper, Sarah C.B., Wigley, Tom M.L., 2011. Emulating coupled atmosphere-ocean and carbon cycle models with a simpler model,\nMAGICC6–Part 1: Model description and calibration. Atmospheric Chem. Phys. 11 (4), 1417–1456.\nMendelsohn, Robert, Dinar, Ariel, Williams, Larry, 2006. The distributional impact of climate change on rich and poor countries. Environ. Dev. Econ. 159–178.\nMendelsohn, Robert, Emanuel, Kerry, Chonabayashi, Shun, Bakkensen, Laura, 2012. The impact of climate change on global tropical cyclone damage. Nature\nClim. Change 2 (3), 205–209, Number: 3 Publisher: Nature Publishing Group.\nNarayan, Kanishka B., O’Neill, Brian C., Waldhoff, Stephanie, Tebaldi, Claudia, 2023a. A consistent dataset for the net income distribution for 190 countries,\naggregated to 32 geographical regions and the world from 1958&ndash;2015. Earth Syst. Sci. Data Discuss. 1–23, Publisher: Copernicus GmbH.\nNarayan, Kanishka B., O’Neill, Brian C., Waldhoff, Stephanie T., Tebaldi, Claudia, 2023b. Non-parametric projections of national income distribution consistent\nwith the Shared Socioeconomic Pathways. Environ. Res. Lett. 18 (4), 044013.\nNewell, Richard G., Prest, Brian C., Sexton, Steven E., 2018. The GDP-temperature relationship: Implications for climate change damages. p. 63, RFF Working\nPaper Series.\nNewell, Richard G., Prest, Brian C., Sexton, Steven E., 2021. The GDP-temperature relationship: implications for climate change damages. J. Environ. Econ.\nManag. 108, 102445.\nNordhaus, William D., 2017. Revisiting the social cost of carbon. Proc. Natl. Acad. Sci. 114 (7), 1518–1523.\nO’Neill, Brian C., Kriegler, Elmar, Ebi, Kristie L., Kemp-Benedict, Eric, Riahi, Keywan, Rothman, Dale S., van Ruijven, Bas J., van Vuuren, Detlef P.,\nBirkmann, Joern, Kok, Kasper, Levy, Marc, Solecki, William, 2017. The roads ahead: Narratives for shared socioeconomic pathways describing world futures\nin the 21st century. Global Environ. Change 42, 169–180.\nPaglialunga, Elena, Coveri, Andrea, Zanfei, Antonello, 2022. Climate change and within-country inequality: New evidence from a global perspective. World Dev.\n159, 106030.\nPalagi, Elisa, Coronese, Matteo, Lamperti, Francesco, Roventini, Andrea, 2022. Climate change and the nonlinear impact of precipitation anomalies on income\ninequality. Proc. Natl. Acad. Sci. 119 (43), e2203595119.\nPretis, Felix, Schwarz, Moritz, Tang, Kevin, Haustein, Karsten, Allen, Myles R., 2018. Uncertain impacts on economic growth when stabilizing global temperatures\nat 1.5 C or 2 C warming. Phil. Trans. R. Soc. A 376 (2119), 20160460.Journal of Environmental Economics and Management 127 (2024) 103012\n12M. Gilli et al.\nRiahi, Keywan, Van Vuuren, Detlef P., Kriegler, Elmar, Edmonds, Jae, O’neill, Brian C., Fujimori, Shinichiro, Bauer, Nico, Calvin, Katherine, Dellink, Rob,\nFricko, Oliver, et al., 2017. The shared socioeconomic pathways and their energy, land use, and greenhouse gas emissions implications: An overview. Glob.\nEnviron. Chang. 42, 153–168.\nSantos, Carlos, Hendry, David F., Johansen, Soren, 2008. Automatic selection of indicators in a fully saturated regression. Comput. Statist. 23, 317–335.\nSedova, Barbora, Kalkuhl, Matthias, Mendelsohn, Robert, 2019. Distributional impacts of weather and climate in rural India. Econ. Disasters Clim. Chang..\nSherwood, S.C., Webb, M.J., Annan, J.D., Armour, K.C., Forster, P.M., Hargreaves, J.C., Hegerl, G., Klein, S.A., Marvel, K.D., Rohling, E.J., Watanabe, M.,\nAndrews, T., Braconnot, P., Bretherton, C.S., Foster, G.L., Hausfather, Z., von der Heydt, A.S., Knutti, R., Mauritsen, T., Norris, J.R., Proistosescu, C.,\nRugenstein, M., Schmidt, G.A., Tokarska, K.B., Zelinka, M.D., 2020. An assessment of Earth’s climate sensitivity using multiple lines of evidence. Rev.\nGeophys. 58 (4), e2019RG000678.\nSomanathan, Eswaran, Somanathan, Rohini, Sudarshan, Anant, Tewari, Meenu, 2021. The impact of temperature on productivity and labor supply: Evidence\nfrom Indian manufacturing. J. Polit. Econ. 129 (6), 1797–1827.\nTaconet, Nicolas, Méjean, Aurélie, Guivarch, Céline, 2020. Influence of climate change impacts and mitigation costs on inequality between countries. Clim.\nChange 160 (1), 15–34.\nTol, Richard S.J., 2021. The distributional impact of climate change. Ann. New York Acad. Sci. 1504 (1), 63–75, _eprint: https://nyaspubs.onlinelibrary.wiley.\ncom/doi/pdf/10.1111/nyas.14497.",
    "Methods": ""
}